/* automatically generated by rust-bindgen 0.72.1 */

pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 36;

pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const OB_WIDTH_ANY: u32 = 0;
pub const OB_HEIGHT_ANY: u32 = 0;
pub const OB_FPS_ANY: u32 = 0;
pub const OB_PROFILE_DEFAULT: u32 = 0;
pub const OB_DEFAULT_STRIDE_BYTES: u32 = 0;
pub const OB_PATH_MAX: u32 = 1024;
pub const INVALID_CALLBACK_ID: u32 = 0;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_context_t {
    _unused: [u8; 0],
}
pub type ob_context = ob_context_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_t {
    _unused: [u8; 0],
}
pub type ob_device = ob_device_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_info_t {
    _unused: [u8; 0],
}
pub type ob_device_info = ob_device_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_list_t {
    _unused: [u8; 0],
}
pub type ob_device_list = ob_device_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_record_device_t {
    _unused: [u8; 0],
}
pub type ob_record_device = ob_record_device_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_playback_device_t {
    _unused: [u8; 0],
}
pub type ob_playback_device = ob_playback_device_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_camera_param_list_t {
    _unused: [u8; 0],
}
pub type ob_camera_param_list = ob_camera_param_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_sensor_t {
    _unused: [u8; 0],
}
pub type ob_sensor = ob_sensor_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_sensor_list_t {
    _unused: [u8; 0],
}
pub type ob_sensor_list = ob_sensor_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_stream_profile_t {
    _unused: [u8; 0],
}
pub type ob_stream_profile = ob_stream_profile_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_stream_profile_list_t {
    _unused: [u8; 0],
}
pub type ob_stream_profile_list = ob_stream_profile_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_frame_t {
    _unused: [u8; 0],
}
pub type ob_frame = ob_frame_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_filter_t {
    _unused: [u8; 0],
}
pub type ob_filter = ob_filter_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_filter_list_t {
    _unused: [u8; 0],
}
pub type ob_filter_list = ob_filter_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_pipeline_t {
    _unused: [u8; 0],
}
pub type ob_pipeline = ob_pipeline_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_config_t {
    _unused: [u8; 0],
}
pub type ob_config = ob_config_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_depth_work_mode_list_t {
    _unused: [u8; 0],
}
pub type ob_depth_work_mode_list = ob_depth_work_mode_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_preset_list_t {
    _unused: [u8; 0],
}
pub type ob_device_preset_list = ob_device_preset_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_filter_config_schema_list_t {
    _unused: [u8; 0],
}
pub type ob_filter_config_schema_list = ob_filter_config_schema_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_frame_interleave_list_t {
    _unused: [u8; 0],
}
pub type ob_device_frame_interleave_list = ob_device_frame_interleave_list_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ob_preset_resolution_config_list_t {
    _unused: [u8; 0],
}
pub type ob_preset_resolution_config_list = ob_preset_resolution_config_list_t;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief the permission type of api or property"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPermissionType {
    #[doc = "no permission"]
    Deny = 0,
    #[doc = "can read"]
    Read = 1,
    #[doc = "can write"]
    Write = 2,
    #[doc = "can read and write"]
    ReadWrite = 3,
    #[doc = "any situation above"]
    Any = 255,
}
#[doc = "@brief the permission type of api or property"]
pub use self::OBPermissionType as ob_permission_type;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief error code"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBStatus {
    #[doc = "status ok"]
    Ok = 0,
    #[doc = "status error"]
    Error = 1,
}
#[doc = "@brief error code"]
pub use self::OBStatus as ob_status;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief log level, the higher the level, the stronger the log filter"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDeviceLogSeverityLevel {
    #[doc = "debug"]
    Debug = 0,
    #[doc = "information"]
    Info = 1,
    #[doc = "warning"]
    Warn = 2,
    #[doc = "error"]
    Error = 3,
    #[doc = "fatal error"]
    Fatal = 4,
    #[doc = "off (close LOG)"]
    Off = 5,
}
#[doc = "@brief log level, the higher the level, the stronger the log filter"]
pub use self::OBDeviceLogSeverityLevel as ob_log_severity;
#[doc = "@brief log level, the higher the level, the stronger the log filter"]
pub use self::OBDeviceLogSeverityLevel as DEVICE_LOG_SEVERITY_LEVEL;
#[doc = "@brief log level, the higher the level, the stronger the log filter"]
pub use self::OBDeviceLogSeverityLevel as ob_device_log_severity_level;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief The exception types in the SDK, through the exception type, you can easily determine the specific type of error.\n For detailed error API interface functions and error logs, please refer to the information of ob_error"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBExceptionType {
    #[doc = "Unknown error, an error not clearly defined by the SDK"]
    Unknown = 0,
    StdException = 1,
    #[doc = "Camera/Device has been disconnected, the camera/device is not available"]
    CameraDisconnected = 2,
    #[doc = "An error in the SDK adaptation platform layer, which means an error in the implementation of a specific system\nplatform"]
    Platform = 3,
    #[doc = "Invalid parameter type exception, need to check input parameter"]
    InvalidValue = 4,
    #[doc = "Wrong API call sequence, the API is called in the wrong order or the wrong parameter is passed"]
    WrongApiCallSequence = 5,
    #[doc = "SDK and firmware have not yet implemented this function or feature"]
    NotImplemented = 6,
    #[doc = "SDK access IO exception error"]
    Io = 7,
    #[doc = "SDK access and use memory errors. For example, the frame fails to allocate memory"]
    Memory = 8,
    #[doc = "Unsupported operation type error by SDK or device"]
    UnsupportedOperation = 9,
    #[doc = "Device access denied"]
    AccessDenied = 10,
}
#[doc = "@brief The exception types in the SDK, through the exception type, you can easily determine the specific type of error.\n For detailed error API interface functions and error logs, please refer to the information of ob_error"]
pub use self::OBExceptionType as ob_exception_type;
#[doc = "@brief The error class exposed by the SDK, users can get detailed error information according to the error"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ob_error {
    #[doc = "Describe the status code of the error, as compatible with previous customer status code requirements"]
    pub status: ob_status,
    #[doc = "Describe the detailed error log"]
    pub message: [::std::os::raw::c_char; 256usize],
    #[doc = "Describe the name of the function where the error occurred"]
    pub function: [::std::os::raw::c_char; 256usize],
    #[doc = "Describes the parameters passed to the function when an error occurs. Used to check whether the parameter is wrong"]
    pub args: [::std::os::raw::c_char; 256usize],
    #[doc = "The description is the specific error type of the SDK"]
    pub exception_type: ob_exception_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ob_error"][::std::mem::size_of::<ob_error>() - 776usize];
    ["Alignment of ob_error"][::std::mem::align_of::<ob_error>() - 1usize];
    ["Offset of field: ob_error::status"][::std::mem::offset_of!(ob_error, status) - 0usize];
    ["Offset of field: ob_error::message"][::std::mem::offset_of!(ob_error, message) - 4usize];
    ["Offset of field: ob_error::function"][::std::mem::offset_of!(ob_error, function) - 260usize];
    ["Offset of field: ob_error::args"][::std::mem::offset_of!(ob_error, args) - 516usize];
    ["Offset of field: ob_error::exception_type"]
        [::std::mem::offset_of!(ob_error, exception_type) - 772usize];
};
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the sensor type"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBSensorType {
    #[doc = "Unknown type sensor"]
    Unknown = 0,
    #[doc = "IR"]
    Ir = 1,
    #[doc = "Color"]
    Color = 2,
    #[doc = "Depth"]
    Depth = 3,
    #[doc = "Accel"]
    Accel = 4,
    #[doc = "Gyro"]
    Gyro = 5,
    #[doc = "left IR for stereo camera"]
    IrLeft = 6,
    #[doc = "Right IR for stereo camera"]
    IrRight = 7,
    #[doc = "Raw Phase"]
    RawPhase = 8,
    #[doc = "Confidence"]
    Confidence = 9,
    #[doc = "LiDAR"]
    Lidar = 10,
    #[doc = "Left Color"]
    ColorLeft = 11,
    #[doc = "Right Color"]
    ColorRight = 12,
}
#[doc = "@brief Enumeration value describing the sensor type"]
pub use self::OBSensorType as ob_sensor_type;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the type of data stream"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBStreamType {
    #[doc = "Unknown type stream"]
    Unknown = -1,
    #[doc = "Video stream (infrared, color, depth streams are all video streams)"]
    Video = 0,
    #[doc = "IR stream"]
    Ir = 1,
    #[doc = "color stream"]
    Color = 2,
    #[doc = "depth stream"]
    Depth = 3,
    #[doc = "Accelerometer data stream"]
    Accel = 4,
    #[doc = "Gyroscope data stream"]
    Gyro = 5,
    #[doc = "Left IR stream for stereo camera"]
    IrLeft = 6,
    #[doc = "Right IR stream for stereo camera"]
    IrRight = 7,
    #[doc = "RawPhase Stream"]
    RawPhase = 8,
    #[doc = "Confidence Stream"]
    Confidence = 9,
    #[doc = "LiDAR Stream for LiDAR device"]
    Lidar = 10,
    #[doc = "Left Color stream"]
    ColorLeft = 11,
    #[doc = "Right Color stream"]
    ColorRight = 12,
}
#[doc = "@brief Enumeration value describing the type of data stream"]
pub use self::OBStreamType as ob_stream_type;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the type of frame"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFrameType {
    #[doc = "Unknown frame type"]
    Unknown = -1,
    #[doc = "Video frame"]
    Video = 0,
    #[doc = "IR frame"]
    Ir = 1,
    #[doc = "Color frame"]
    Color = 2,
    #[doc = "Depth frame"]
    Depth = 3,
    #[doc = "Accelerometer data frame"]
    Accel = 4,
    #[doc = "Frame collection (internally contains a variety of data frames)"]
    Set = 5,
    #[doc = "Point cloud frame"]
    Points = 6,
    #[doc = "Gyroscope data frame"]
    Gyro = 7,
    #[doc = "Left IR frame for stereo camera"]
    IrLeft = 8,
    #[doc = "Right IR frame for stereo camera"]
    IrRight = 9,
    #[doc = "Raw Phase frame"]
    RawPhase = 10,
    #[doc = "Confidence frame"]
    Confidence = 11,
    #[doc = "LiDAR point3d cloud frame"]
    LidarPoints = 12,
    #[doc = "Left Color frame"]
    ColorLeft = 13,
    #[doc = "Right Color frame"]
    ColorRight = 14,
}
#[doc = "@brief Enumeration value describing the type of frame"]
pub use self::OBFrameType as ob_frame_type;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the pixel type of frame (usually used for depth frame)"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPixelType {
    Unknown = -1,
    Depth = 0,
    Disparity = 2,
    RawPhase = 3,
    TofDepth = 4,
}
#[doc = "@brief Enumeration value describing the pixel type of frame (usually used for depth frame)"]
pub use self::OBPixelType as ob_pixel_type;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the pixel format"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFormat {
    #[doc = "unknown format"]
    Unknown = -1,
    #[doc = "YUYV format"]
    Yuyv = 0,
    #[doc = "YUY2 format (the actual format is the same as YUYV)"]
    Yuy2 = 1,
    #[doc = "UYVY format"]
    Uyvy = 2,
    #[doc = "NV12 format"]
    Nv12 = 3,
    #[doc = "NV21 format"]
    Nv21 = 4,
    #[doc = "MJPEG encoding format"]
    Mjpg = 5,
    #[doc = "H.264 encoding format"]
    H264 = 6,
    #[doc = "H.265 encoding format"]
    H265 = 7,
    #[doc = "Y16 format, 16-bit per pixel, single-channel"]
    Y16 = 8,
    #[doc = "Y8 format, 8-bit per pixel, single-channel"]
    Y8 = 9,
    #[doc = "Y10 format, 10-bit per pixel, single-channel(SDK will unpack into Y16 by default)"]
    Y10 = 10,
    #[doc = "Y11 format, 11-bit per pixel, single-channel (SDK will unpack into Y16 by default)"]
    Y11 = 11,
    #[doc = "Y12 format, 12-bit per pixel, single-channel(SDK will unpack into Y16 by default)"]
    Y12 = 12,
    #[doc = "GRAY (the actual format is the same as YUYV)"]
    Gray = 13,
    #[doc = "HEVC encoding format (the actual format is the same as H265)"]
    Hevc = 14,
    #[doc = "I420 format"]
    I420 = 15,
    #[doc = "Acceleration data format"]
    Accel = 16,
    #[doc = "Gyroscope data format"]
    Gyro = 17,
    #[doc = "XYZ 3D coordinate point format, @ref OBPoint"]
    Point = 19,
    #[doc = "XYZ 3D coordinate point format with RGB information, @ref OBColorPoint"]
    RgbPoint = 20,
    #[doc = "RLE pressure test format (SDK will be unpacked into Y16 by default)"]
    Rle = 21,
    #[doc = "RGB format (actual RGB888)"]
    Rgb = 22,
    #[doc = "BGR format (actual BGR888)"]
    Bgr = 23,
    #[doc = "Y14 format, 14-bit per pixel, single-channel (SDK will unpack into Y16 by default)"]
    Y14 = 24,
    #[doc = "BGRA format"]
    Bgra = 25,
    #[doc = "Compression format"]
    Compressed = 26,
    #[doc = "RVL pressure test format (SDK will be unpacked into Y16 by default)"]
    Rvl = 27,
    #[doc = "Is same as Y16"]
    Z16 = 28,
    #[doc = "Is same as Y12, using for right ir stream"]
    Yv12 = 29,
    #[doc = "Is same as Y8, using for right ir stream"]
    Ba81 = 30,
    #[doc = "RGBA format"]
    Rgba = 31,
    #[doc = "byr2 format"]
    Byr2 = 32,
    #[doc = "RAW16 format"]
    Rw16 = 33,
    #[doc = "Y12C4 format"]
    Y12C4 = 34,
    #[doc = "XYZ 3D coordinate point format with LiDAR information, @ref OBLiDARPoint"]
    LidarPoint = 35,
    #[doc = "Spherical coordinate point format with LiDAR information, @ref OBLiDARSpherePoint"]
    LidarSpherePoint = 36,
    #[doc = "LiDAR single-line scan mode data format, @ref OBLiDARScanPoint"]
    LidarScan = 37,
    #[doc = "LiDAR calibration mode point format"]
    LidarCalibration = 38,
}
#[doc = "@brief Enumeration value describing the pixel format"]
pub use self::OBFormat as ob_format;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the firmware upgrade status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFwUpdateState {
    #[doc = "update completed and device requires manual reboot and a second update"]
    StatDoneRebootAndReupdate = 7,
    #[doc = "update completed, but some files were duplicated and ignored"]
    StatDoneWithDuplicates = 6,
    #[doc = "Image file verifify success"]
    StatVerifySuccess = 5,
    #[doc = "file transfer"]
    StatFileTransfer = 4,
    #[doc = "update completed"]
    StatDone = 3,
    #[doc = "upgrade in process"]
    StatInProgress = 2,
    #[doc = "start the upgrade"]
    StatStart = 1,
    #[doc = "Image file verification"]
    StatVerifyImage = 0,
    #[doc = "Verification failed"]
    ErrVerify = -1,
    #[doc = "Program execution failed"]
    ErrProgram = -2,
    #[doc = "Flash parameter failed"]
    ErrErase = -3,
    #[doc = "Flash type error"]
    ErrFlashType = -4,
    #[doc = "Image file size error"]
    ErrImageSize = -5,
    #[doc = "other errors"]
    ErrOther = -6,
    #[doc = "DDR access error"]
    ErrDdr = -7,
    #[doc = "timeout error"]
    ErrTimeout = -8,
    #[doc = "Mismatch firmware error"]
    ErrMismatch = -9,
    #[doc = "Unsupported device error"]
    ErrUnsupportDev = -10,
    #[doc = "invalid firmware/preset count"]
    ErrInvalidCount = -11,
    #[doc = "Read image file error"]
    ErrFileRead = -12,
    #[doc = "Transfer failed"]
    ErrTransfer = -13,
}
#[doc = "@brief Enumeration value describing the firmware upgrade status"]
pub use self::OBFwUpdateState as ob_upgrade_state;
#[doc = "@brief Enumeration value describing the firmware upgrade status"]
pub use self::OBFwUpdateState as ob_fw_update_state;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the file transfer status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFileTranState {
    #[doc = "File transfer"]
    StatTransfer = 2,
    #[doc = "File transfer succeeded"]
    StatDone = 1,
    #[doc = "Preparing"]
    StatPrepar = 0,
    #[doc = "DDR access failed"]
    ErrDdr = -1,
    #[doc = "Insufficient target space error"]
    ErrNotEnoughSpace = -2,
    #[doc = "Destination path is not writable"]
    ErrPathNotWritable = -3,
    #[doc = "MD5 checksum error"]
    ErrMd5Error = -4,
    #[doc = "Write flash error"]
    ErrWriteFlashError = -5,
    #[doc = "Timeout error"]
    ErrTimeout = -6,
}
#[doc = "@brief Enumeration value describing the file transfer status"]
pub use self::OBFileTranState as ob_file_tran_state;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing the data transfer status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDataTranState {
    #[doc = "data verify done"]
    StatVerifyDone = 4,
    #[doc = "data transfer stoped"]
    StatStopped = 3,
    #[doc = "data transfer completed"]
    StatDone = 2,
    #[doc = "data verifying"]
    StatVerifying = 1,
    #[doc = "data transferring"]
    StatTransferring = 0,
    #[doc = "Transmission is busy"]
    ErrBusy = -1,
    #[doc = "Not supported"]
    ErrUnsupported = -2,
    #[doc = "Transfer failed"]
    ErrTranFailed = -3,
    #[doc = "Test failed"]
    ErrVerifyFailed = -4,
    #[doc = "Other errors"]
    ErrOther = -5,
}
#[doc = "@brief Enumeration value describing the data transfer status"]
pub use self::OBDataTranState as ob_data_tran_state;
#[doc = "@brief Structure for transmitting data blocks"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBDataChunk {
    #[doc = "Pointer to current block data"]
    pub data: *mut u8,
    #[doc = "Length of current block data"]
    pub size: u32,
    #[doc = "Offset of current data block relative to complete data"]
    pub offset: u32,
    #[doc = "Size of full data"]
    pub fullDataSize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDataChunk"][::std::mem::size_of::<OBDataChunk>() - 20usize];
    ["Alignment of OBDataChunk"][::std::mem::align_of::<OBDataChunk>() - 1usize];
    ["Offset of field: OBDataChunk::data"][::std::mem::offset_of!(OBDataChunk, data) - 0usize];
    ["Offset of field: OBDataChunk::size"][::std::mem::offset_of!(OBDataChunk, size) - 8usize];
    ["Offset of field: OBDataChunk::offset"][::std::mem::offset_of!(OBDataChunk, offset) - 12usize];
    ["Offset of field: OBDataChunk::fullDataSize"]
        [::std::mem::offset_of!(OBDataChunk, fullDataSize) - 16usize];
};
#[doc = "@brief Structure for transmitting data blocks"]
pub type ob_data_chunk = OBDataChunk;
#[doc = "@brief Structure for integer range"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBIntPropertyRange {
    #[doc = "Current value"]
    pub cur: i32,
    #[doc = "Maximum value"]
    pub max: i32,
    #[doc = "Minimum value"]
    pub min: i32,
    #[doc = "Step value"]
    pub step: i32,
    #[doc = "Default value"]
    pub def: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBIntPropertyRange"][::std::mem::size_of::<OBIntPropertyRange>() - 20usize];
    ["Alignment of OBIntPropertyRange"][::std::mem::align_of::<OBIntPropertyRange>() - 1usize];
    ["Offset of field: OBIntPropertyRange::cur"]
        [::std::mem::offset_of!(OBIntPropertyRange, cur) - 0usize];
    ["Offset of field: OBIntPropertyRange::max"]
        [::std::mem::offset_of!(OBIntPropertyRange, max) - 4usize];
    ["Offset of field: OBIntPropertyRange::min"]
        [::std::mem::offset_of!(OBIntPropertyRange, min) - 8usize];
    ["Offset of field: OBIntPropertyRange::step"]
        [::std::mem::offset_of!(OBIntPropertyRange, step) - 12usize];
    ["Offset of field: OBIntPropertyRange::def"]
        [::std::mem::offset_of!(OBIntPropertyRange, def) - 16usize];
};
#[doc = "@brief Structure for integer range"]
pub type ob_int_property_range = OBIntPropertyRange;
#[doc = "@brief Structure for float range"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBFloatPropertyRange {
    #[doc = "Current value"]
    pub cur: f32,
    #[doc = "Maximum value"]
    pub max: f32,
    #[doc = "Minimum value"]
    pub min: f32,
    #[doc = "Step value"]
    pub step: f32,
    #[doc = "Default value"]
    pub def: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBFloatPropertyRange"][::std::mem::size_of::<OBFloatPropertyRange>() - 20usize];
    ["Alignment of OBFloatPropertyRange"][::std::mem::align_of::<OBFloatPropertyRange>() - 1usize];
    ["Offset of field: OBFloatPropertyRange::cur"]
        [::std::mem::offset_of!(OBFloatPropertyRange, cur) - 0usize];
    ["Offset of field: OBFloatPropertyRange::max"]
        [::std::mem::offset_of!(OBFloatPropertyRange, max) - 4usize];
    ["Offset of field: OBFloatPropertyRange::min"]
        [::std::mem::offset_of!(OBFloatPropertyRange, min) - 8usize];
    ["Offset of field: OBFloatPropertyRange::step"]
        [::std::mem::offset_of!(OBFloatPropertyRange, step) - 12usize];
    ["Offset of field: OBFloatPropertyRange::def"]
        [::std::mem::offset_of!(OBFloatPropertyRange, def) - 16usize];
};
#[doc = "@brief Structure for float range"]
pub type ob_float_property_range = OBFloatPropertyRange;
#[doc = "@brief Structure for float range"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBUint16PropertyRange {
    #[doc = "Current value"]
    pub cur: u16,
    #[doc = "Maximum value"]
    pub max: u16,
    #[doc = "Minimum value"]
    pub min: u16,
    #[doc = "Step value"]
    pub step: u16,
    #[doc = "Default value"]
    pub def: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBUint16PropertyRange"][::std::mem::size_of::<OBUint16PropertyRange>() - 10usize];
    ["Alignment of OBUint16PropertyRange"]
        [::std::mem::align_of::<OBUint16PropertyRange>() - 1usize];
    ["Offset of field: OBUint16PropertyRange::cur"]
        [::std::mem::offset_of!(OBUint16PropertyRange, cur) - 0usize];
    ["Offset of field: OBUint16PropertyRange::max"]
        [::std::mem::offset_of!(OBUint16PropertyRange, max) - 2usize];
    ["Offset of field: OBUint16PropertyRange::min"]
        [::std::mem::offset_of!(OBUint16PropertyRange, min) - 4usize];
    ["Offset of field: OBUint16PropertyRange::step"]
        [::std::mem::offset_of!(OBUint16PropertyRange, step) - 6usize];
    ["Offset of field: OBUint16PropertyRange::def"]
        [::std::mem::offset_of!(OBUint16PropertyRange, def) - 8usize];
};
#[doc = "@brief Structure for float range"]
pub type ob_uint16_property_range = OBUint16PropertyRange;
#[doc = "@brief Structure for float range"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBUint8PropertyRange {
    #[doc = "Current value"]
    pub cur: u8,
    #[doc = "Maximum value"]
    pub max: u8,
    #[doc = "Minimum value"]
    pub min: u8,
    #[doc = "Step value"]
    pub step: u8,
    #[doc = "Default value"]
    pub def: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBUint8PropertyRange"][::std::mem::size_of::<OBUint8PropertyRange>() - 5usize];
    ["Alignment of OBUint8PropertyRange"][::std::mem::align_of::<OBUint8PropertyRange>() - 1usize];
    ["Offset of field: OBUint8PropertyRange::cur"]
        [::std::mem::offset_of!(OBUint8PropertyRange, cur) - 0usize];
    ["Offset of field: OBUint8PropertyRange::max"]
        [::std::mem::offset_of!(OBUint8PropertyRange, max) - 1usize];
    ["Offset of field: OBUint8PropertyRange::min"]
        [::std::mem::offset_of!(OBUint8PropertyRange, min) - 2usize];
    ["Offset of field: OBUint8PropertyRange::step"]
        [::std::mem::offset_of!(OBUint8PropertyRange, step) - 3usize];
    ["Offset of field: OBUint8PropertyRange::def"]
        [::std::mem::offset_of!(OBUint8PropertyRange, def) - 4usize];
};
#[doc = "@brief Structure for float range"]
pub type ob_uint8_property_range = OBUint8PropertyRange;
#[doc = "@brief Structure for boolean range"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBBoolPropertyRange {
    #[doc = "Current value"]
    pub cur: bool,
    #[doc = "Maximum value"]
    pub max: bool,
    #[doc = "Minimum value"]
    pub min: bool,
    #[doc = "Step value"]
    pub step: bool,
    #[doc = "Default value"]
    pub def: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBBoolPropertyRange"][::std::mem::size_of::<OBBoolPropertyRange>() - 5usize];
    ["Alignment of OBBoolPropertyRange"][::std::mem::align_of::<OBBoolPropertyRange>() - 1usize];
    ["Offset of field: OBBoolPropertyRange::cur"]
        [::std::mem::offset_of!(OBBoolPropertyRange, cur) - 0usize];
    ["Offset of field: OBBoolPropertyRange::max"]
        [::std::mem::offset_of!(OBBoolPropertyRange, max) - 1usize];
    ["Offset of field: OBBoolPropertyRange::min"]
        [::std::mem::offset_of!(OBBoolPropertyRange, min) - 2usize];
    ["Offset of field: OBBoolPropertyRange::step"]
        [::std::mem::offset_of!(OBBoolPropertyRange, step) - 3usize];
    ["Offset of field: OBBoolPropertyRange::def"]
        [::std::mem::offset_of!(OBBoolPropertyRange, def) - 4usize];
};
#[doc = "@brief Structure for boolean range"]
pub type ob_bool_property_range = OBBoolPropertyRange;
#[repr(u32)]
#[non_exhaustive]
#[doc = "\\brief Distortion model: defines how pixel coordinates should be mapped to sensor coordinates."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCameraDistortionModel {
    #[doc = "Rectilinear images. No distortion compensation required."]
    None = 0,
    #[doc = "Equivalent to Brown-Conrady distortion, except that tangential distortion is applied to radially distorted points"]
    ModifiedBrownConrady = 1,
    #[doc = "Equivalent to Brown-Conrady distortion, except undistorts image instead of distorting it"]
    InverseBrownConrady = 2,
    #[doc = "Unmodified Brown-Conrady distortion model"]
    BrownConrady = 3,
    #[doc = "Unmodified Brown-Conrady distortion model with k6 supported"]
    BrownConradyK6 = 4,
    #[doc = "Kannala-Brandt distortion model"]
    KannalaBrandt4 = 5,
}
#[doc = "\\brief Distortion model: defines how pixel coordinates should be mapped to sensor coordinates."]
pub use self::OBCameraDistortionModel as ob_camera_distortion_model;
#[doc = "@brief Structure for camera intrinsic parameters"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBCameraIntrinsic {
    #[doc = "Focal length in x direction"]
    pub fx: f32,
    #[doc = "Focal length in y direction"]
    pub fy: f32,
    #[doc = "Optical center abscissa"]
    pub cx: f32,
    #[doc = "Optical center ordinate"]
    pub cy: f32,
    #[doc = "Image width"]
    pub width: i16,
    #[doc = "Image height"]
    pub height: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBCameraIntrinsic"][::std::mem::size_of::<OBCameraIntrinsic>() - 20usize];
    ["Alignment of OBCameraIntrinsic"][::std::mem::align_of::<OBCameraIntrinsic>() - 1usize];
    ["Offset of field: OBCameraIntrinsic::fx"]
        [::std::mem::offset_of!(OBCameraIntrinsic, fx) - 0usize];
    ["Offset of field: OBCameraIntrinsic::fy"]
        [::std::mem::offset_of!(OBCameraIntrinsic, fy) - 4usize];
    ["Offset of field: OBCameraIntrinsic::cx"]
        [::std::mem::offset_of!(OBCameraIntrinsic, cx) - 8usize];
    ["Offset of field: OBCameraIntrinsic::cy"]
        [::std::mem::offset_of!(OBCameraIntrinsic, cy) - 12usize];
    ["Offset of field: OBCameraIntrinsic::width"]
        [::std::mem::offset_of!(OBCameraIntrinsic, width) - 16usize];
    ["Offset of field: OBCameraIntrinsic::height"]
        [::std::mem::offset_of!(OBCameraIntrinsic, height) - 18usize];
};
#[doc = "@brief Structure for camera intrinsic parameters"]
pub type ob_camera_intrinsic = OBCameraIntrinsic;
#[doc = "@brief Structure for accelerometer intrinsic parameters"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBAccelIntrinsic {
    #[doc = "In-run bias instability"]
    pub noiseDensity: f64,
    #[doc = "random walk"]
    pub randomWalk: f64,
    #[doc = "reference temperature"]
    pub referenceTemp: f64,
    #[doc = "bias for x, y, z axis"]
    pub bias: [f64; 3usize],
    #[doc = "gravity direction for x, y, z axis"]
    pub gravity: [f64; 3usize],
    #[doc = "scale factor and three-axis non-orthogonal error"]
    pub scaleMisalignment: [f64; 9usize],
    #[doc = "linear temperature drift coefficient"]
    pub tempSlope: [f64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBAccelIntrinsic"][::std::mem::size_of::<OBAccelIntrinsic>() - 216usize];
    ["Alignment of OBAccelIntrinsic"][::std::mem::align_of::<OBAccelIntrinsic>() - 1usize];
    ["Offset of field: OBAccelIntrinsic::noiseDensity"]
        [::std::mem::offset_of!(OBAccelIntrinsic, noiseDensity) - 0usize];
    ["Offset of field: OBAccelIntrinsic::randomWalk"]
        [::std::mem::offset_of!(OBAccelIntrinsic, randomWalk) - 8usize];
    ["Offset of field: OBAccelIntrinsic::referenceTemp"]
        [::std::mem::offset_of!(OBAccelIntrinsic, referenceTemp) - 16usize];
    ["Offset of field: OBAccelIntrinsic::bias"]
        [::std::mem::offset_of!(OBAccelIntrinsic, bias) - 24usize];
    ["Offset of field: OBAccelIntrinsic::gravity"]
        [::std::mem::offset_of!(OBAccelIntrinsic, gravity) - 48usize];
    ["Offset of field: OBAccelIntrinsic::scaleMisalignment"]
        [::std::mem::offset_of!(OBAccelIntrinsic, scaleMisalignment) - 72usize];
    ["Offset of field: OBAccelIntrinsic::tempSlope"]
        [::std::mem::offset_of!(OBAccelIntrinsic, tempSlope) - 144usize];
};
#[doc = "@brief Structure for accelerometer intrinsic parameters"]
pub type ob_accel_intrinsic = OBAccelIntrinsic;
#[doc = "@brief Structure for gyroscope intrinsic parameters"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBGyroIntrinsic {
    #[doc = "In-run bias instability"]
    pub noiseDensity: f64,
    #[doc = "random walk"]
    pub randomWalk: f64,
    #[doc = "reference temperature"]
    pub referenceTemp: f64,
    #[doc = "bias for x, y, z axis"]
    pub bias: [f64; 3usize],
    #[doc = "scale factor and three-axis non-orthogonal error"]
    pub scaleMisalignment: [f64; 9usize],
    #[doc = "linear temperature drift coefficient"]
    pub tempSlope: [f64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBGyroIntrinsic"][::std::mem::size_of::<OBGyroIntrinsic>() - 192usize];
    ["Alignment of OBGyroIntrinsic"][::std::mem::align_of::<OBGyroIntrinsic>() - 1usize];
    ["Offset of field: OBGyroIntrinsic::noiseDensity"]
        [::std::mem::offset_of!(OBGyroIntrinsic, noiseDensity) - 0usize];
    ["Offset of field: OBGyroIntrinsic::randomWalk"]
        [::std::mem::offset_of!(OBGyroIntrinsic, randomWalk) - 8usize];
    ["Offset of field: OBGyroIntrinsic::referenceTemp"]
        [::std::mem::offset_of!(OBGyroIntrinsic, referenceTemp) - 16usize];
    ["Offset of field: OBGyroIntrinsic::bias"]
        [::std::mem::offset_of!(OBGyroIntrinsic, bias) - 24usize];
    ["Offset of field: OBGyroIntrinsic::scaleMisalignment"]
        [::std::mem::offset_of!(OBGyroIntrinsic, scaleMisalignment) - 48usize];
    ["Offset of field: OBGyroIntrinsic::tempSlope"]
        [::std::mem::offset_of!(OBGyroIntrinsic, tempSlope) - 120usize];
};
#[doc = "@brief Structure for gyroscope intrinsic parameters"]
pub type ob_gyro_intrinsic = OBGyroIntrinsic;
#[doc = "@brief Structure for distortion parameters"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBCameraDistortion {
    #[doc = "Radial distortion factor 1"]
    pub k1: f32,
    #[doc = "Radial distortion factor 2"]
    pub k2: f32,
    #[doc = "Radial distortion factor 3"]
    pub k3: f32,
    #[doc = "Radial distortion factor 4"]
    pub k4: f32,
    #[doc = "Radial distortion factor 5"]
    pub k5: f32,
    #[doc = "Radial distortion factor 6"]
    pub k6: f32,
    #[doc = "Tangential distortion factor 1"]
    pub p1: f32,
    #[doc = "Tangential distortion factor 2"]
    pub p2: f32,
    pub model: OBCameraDistortionModel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBCameraDistortion"][::std::mem::size_of::<OBCameraDistortion>() - 36usize];
    ["Alignment of OBCameraDistortion"][::std::mem::align_of::<OBCameraDistortion>() - 1usize];
    ["Offset of field: OBCameraDistortion::k1"]
        [::std::mem::offset_of!(OBCameraDistortion, k1) - 0usize];
    ["Offset of field: OBCameraDistortion::k2"]
        [::std::mem::offset_of!(OBCameraDistortion, k2) - 4usize];
    ["Offset of field: OBCameraDistortion::k3"]
        [::std::mem::offset_of!(OBCameraDistortion, k3) - 8usize];
    ["Offset of field: OBCameraDistortion::k4"]
        [::std::mem::offset_of!(OBCameraDistortion, k4) - 12usize];
    ["Offset of field: OBCameraDistortion::k5"]
        [::std::mem::offset_of!(OBCameraDistortion, k5) - 16usize];
    ["Offset of field: OBCameraDistortion::k6"]
        [::std::mem::offset_of!(OBCameraDistortion, k6) - 20usize];
    ["Offset of field: OBCameraDistortion::p1"]
        [::std::mem::offset_of!(OBCameraDistortion, p1) - 24usize];
    ["Offset of field: OBCameraDistortion::p2"]
        [::std::mem::offset_of!(OBCameraDistortion, p2) - 28usize];
    ["Offset of field: OBCameraDistortion::model"]
        [::std::mem::offset_of!(OBCameraDistortion, model) - 32usize];
};
#[doc = "@brief Structure for distortion parameters"]
pub type ob_camera_distortion = OBCameraDistortion;
#[doc = "@brief Structure for rotation/transformation"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBD2CTransform {
    #[doc = "Rotation matrix"]
    pub rot: [f32; 9usize],
    #[doc = "Transformation matrix in millimeters"]
    pub trans: [f32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBD2CTransform"][::std::mem::size_of::<OBD2CTransform>() - 48usize];
    ["Alignment of OBD2CTransform"][::std::mem::align_of::<OBD2CTransform>() - 1usize];
    ["Offset of field: OBD2CTransform::rot"][::std::mem::offset_of!(OBD2CTransform, rot) - 0usize];
    ["Offset of field: OBD2CTransform::trans"]
        [::std::mem::offset_of!(OBD2CTransform, trans) - 36usize];
};
#[doc = "@brief Structure for rotation/transformation"]
pub type ob_d2c_transform = OBD2CTransform;
#[doc = "@brief Structure for rotation/transformation"]
pub type OBTransform = OBD2CTransform;
#[doc = "@brief Structure for rotation/transformation"]
pub type ob_transform = OBD2CTransform;
#[doc = "@brief Structure for rotation/transformation"]
pub type OBExtrinsic = OBD2CTransform;
#[doc = "@brief Structure for rotation/transformation"]
pub type ob_extrinsic = OBD2CTransform;
#[doc = "@brief Structure for camera parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBCameraParam {
    #[doc = "Depth camera internal parameters"]
    pub depthIntrinsic: OBCameraIntrinsic,
    #[doc = "Color camera internal parameters"]
    pub rgbIntrinsic: OBCameraIntrinsic,
    #[doc = "Depth camera distortion parameters"]
    pub depthDistortion: OBCameraDistortion,
    #[doc = "Color camera distortion parameters"]
    pub rgbDistortion: OBCameraDistortion,
    #[doc = "Rotation/transformation matrix"]
    pub transform: OBD2CTransform,
    #[doc = "Whether the image frame corresponding to this group of parameters is mirrored"]
    pub isMirrored: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBCameraParam"][::std::mem::size_of::<OBCameraParam>() - 161usize];
    ["Alignment of OBCameraParam"][::std::mem::align_of::<OBCameraParam>() - 1usize];
    ["Offset of field: OBCameraParam::depthIntrinsic"]
        [::std::mem::offset_of!(OBCameraParam, depthIntrinsic) - 0usize];
    ["Offset of field: OBCameraParam::rgbIntrinsic"]
        [::std::mem::offset_of!(OBCameraParam, rgbIntrinsic) - 20usize];
    ["Offset of field: OBCameraParam::depthDistortion"]
        [::std::mem::offset_of!(OBCameraParam, depthDistortion) - 40usize];
    ["Offset of field: OBCameraParam::rgbDistortion"]
        [::std::mem::offset_of!(OBCameraParam, rgbDistortion) - 76usize];
    ["Offset of field: OBCameraParam::transform"]
        [::std::mem::offset_of!(OBCameraParam, transform) - 112usize];
    ["Offset of field: OBCameraParam::isMirrored"]
        [::std::mem::offset_of!(OBCameraParam, isMirrored) - 160usize];
};
#[doc = "@brief Structure for camera parameters"]
pub type ob_camera_param = OBCameraParam;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBPresetResolutionConfig {
    #[doc = "width"]
    pub width: i16,
    #[doc = "height"]
    pub height: i16,
    #[doc = "ir decimation factor"]
    pub irDecimationFactor: ::std::os::raw::c_int,
    #[doc = "depth decimation factor"]
    pub depthDecimationFactor: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBPresetResolutionConfig"]
        [::std::mem::size_of::<OBPresetResolutionConfig>() - 12usize];
    ["Alignment of OBPresetResolutionConfig"]
        [::std::mem::align_of::<OBPresetResolutionConfig>() - 1usize];
    ["Offset of field: OBPresetResolutionConfig::width"]
        [::std::mem::offset_of!(OBPresetResolutionConfig, width) - 0usize];
    ["Offset of field: OBPresetResolutionConfig::height"]
        [::std::mem::offset_of!(OBPresetResolutionConfig, height) - 2usize];
    ["Offset of field: OBPresetResolutionConfig::irDecimationFactor"]
        [::std::mem::offset_of!(OBPresetResolutionConfig, irDecimationFactor) - 4usize];
    ["Offset of field: OBPresetResolutionConfig::depthDecimationFactor"]
        [::std::mem::offset_of!(OBPresetResolutionConfig, depthDecimationFactor) - 8usize];
};
pub type ob_preset_resolution_ratio_config = OBPresetResolutionConfig;
#[doc = "@brief calibration parameters"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBCalibrationParam {
    #[doc = "Sensor internal parameters"]
    pub intrinsics: [OBCameraIntrinsic; 13usize],
    #[doc = "Sensor distortion"]
    pub distortion: [OBCameraDistortion; 13usize],
    pub extrinsics: [[OBExtrinsic; 13usize]; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBCalibrationParam"][::std::mem::size_of::<OBCalibrationParam>() - 8840usize];
    ["Alignment of OBCalibrationParam"][::std::mem::align_of::<OBCalibrationParam>() - 1usize];
    ["Offset of field: OBCalibrationParam::intrinsics"]
        [::std::mem::offset_of!(OBCalibrationParam, intrinsics) - 0usize];
    ["Offset of field: OBCalibrationParam::distortion"]
        [::std::mem::offset_of!(OBCalibrationParam, distortion) - 260usize];
    ["Offset of field: OBCalibrationParam::extrinsics"]
        [::std::mem::offset_of!(OBCalibrationParam, extrinsics) - 728usize];
};
#[doc = "@brief calibration parameters"]
pub type ob_calibration_param = OBCalibrationParam;
#[doc = "@brief Configuration for depth margin filter"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ob_margin_filter_config {
    #[doc = "Horizontal threshold settings"]
    pub margin_x_th: ::std::os::raw::c_int,
    #[doc = "Vertical threshold settings"]
    pub margin_y_th: ::std::os::raw::c_int,
    #[doc = "Maximum horizontal threshold"]
    pub limit_x_th: ::std::os::raw::c_int,
    #[doc = "Maximum vertical threshold"]
    pub limit_y_th: ::std::os::raw::c_int,
    #[doc = "Image width"]
    pub width: u32,
    #[doc = "Image height"]
    pub height: u32,
    #[doc = "Set to true for horizontal and vertical, false for horizontal only"]
    pub enable_direction: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ob_margin_filter_config"][::std::mem::size_of::<ob_margin_filter_config>() - 25usize];
    ["Alignment of ob_margin_filter_config"]
        [::std::mem::align_of::<ob_margin_filter_config>() - 1usize];
    ["Offset of field: ob_margin_filter_config::margin_x_th"]
        [::std::mem::offset_of!(ob_margin_filter_config, margin_x_th) - 0usize];
    ["Offset of field: ob_margin_filter_config::margin_y_th"]
        [::std::mem::offset_of!(ob_margin_filter_config, margin_y_th) - 4usize];
    ["Offset of field: ob_margin_filter_config::limit_x_th"]
        [::std::mem::offset_of!(ob_margin_filter_config, limit_x_th) - 8usize];
    ["Offset of field: ob_margin_filter_config::limit_y_th"]
        [::std::mem::offset_of!(ob_margin_filter_config, limit_y_th) - 12usize];
    ["Offset of field: ob_margin_filter_config::width"]
        [::std::mem::offset_of!(ob_margin_filter_config, width) - 16usize];
    ["Offset of field: ob_margin_filter_config::height"]
        [::std::mem::offset_of!(ob_margin_filter_config, height) - 20usize];
    ["Offset of field: ob_margin_filter_config::enable_direction"]
        [::std::mem::offset_of!(ob_margin_filter_config, enable_direction) - 24usize];
};
#[doc = "@brief Configuration for depth margin filter"]
pub type OBMarginFilterConfig = ob_margin_filter_config;
#[doc = "@brief Configuration for mgc filter"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBMGCFilterConfig {
    pub width: u32,
    pub height: u32,
    pub max_width_left: ::std::os::raw::c_int,
    pub max_width_right: ::std::os::raw::c_int,
    pub max_radius: ::std::os::raw::c_int,
    pub margin_x_th: ::std::os::raw::c_int,
    pub margin_y_th: ::std::os::raw::c_int,
    pub limit_x_th: ::std::os::raw::c_int,
    pub limit_y_th: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBMGCFilterConfig"][::std::mem::size_of::<OBMGCFilterConfig>() - 36usize];
    ["Alignment of OBMGCFilterConfig"][::std::mem::align_of::<OBMGCFilterConfig>() - 1usize];
    ["Offset of field: OBMGCFilterConfig::width"]
        [::std::mem::offset_of!(OBMGCFilterConfig, width) - 0usize];
    ["Offset of field: OBMGCFilterConfig::height"]
        [::std::mem::offset_of!(OBMGCFilterConfig, height) - 4usize];
    ["Offset of field: OBMGCFilterConfig::max_width_left"]
        [::std::mem::offset_of!(OBMGCFilterConfig, max_width_left) - 8usize];
    ["Offset of field: OBMGCFilterConfig::max_width_right"]
        [::std::mem::offset_of!(OBMGCFilterConfig, max_width_right) - 12usize];
    ["Offset of field: OBMGCFilterConfig::max_radius"]
        [::std::mem::offset_of!(OBMGCFilterConfig, max_radius) - 16usize];
    ["Offset of field: OBMGCFilterConfig::margin_x_th"]
        [::std::mem::offset_of!(OBMGCFilterConfig, margin_x_th) - 20usize];
    ["Offset of field: OBMGCFilterConfig::margin_y_th"]
        [::std::mem::offset_of!(OBMGCFilterConfig, margin_y_th) - 24usize];
    ["Offset of field: OBMGCFilterConfig::limit_x_th"]
        [::std::mem::offset_of!(OBMGCFilterConfig, limit_x_th) - 28usize];
    ["Offset of field: OBMGCFilterConfig::limit_y_th"]
        [::std::mem::offset_of!(OBMGCFilterConfig, limit_y_th) - 32usize];
};
#[doc = "@brief Configuration for mgc filter"]
pub type ob_mgc_filter_config = OBMGCFilterConfig;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Alignment mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBAlignMode {
    #[doc = "Turn off alignment"]
    Disable = 0,
    #[doc = "Hardware D2C alignment mode"]
    D2CHwMode = 1,
    #[doc = "Software D2C alignment mode"]
    D2CSwMode = 2,
}
#[doc = "@brief Alignment mode"]
pub use self::OBAlignMode as ob_align_mode;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Camera performance mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCameraPerformanceMode {
    #[doc = "Camera adaptive mode"]
    AdaptivePerformanceMode = 0,
    #[doc = "High Performance Mode"]
    HighPerformanceMode = 1,
}
#[doc = "@brief Camera performance mode"]
pub use self::OBCameraPerformanceMode as ob_camera_performance_mode;
#[doc = "@brief Rectangle"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBRect {
    #[doc = "Origin coordinate x"]
    pub x: u32,
    #[doc = "Origin coordinate y"]
    pub y: u32,
    #[doc = "Rectangle width"]
    pub width: u32,
    #[doc = "Rectangle height"]
    pub height: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBRect"][::std::mem::size_of::<OBRect>() - 16usize];
    ["Alignment of OBRect"][::std::mem::align_of::<OBRect>() - 1usize];
    ["Offset of field: OBRect::x"][::std::mem::offset_of!(OBRect, x) - 0usize];
    ["Offset of field: OBRect::y"][::std::mem::offset_of!(OBRect, y) - 4usize];
    ["Offset of field: OBRect::width"][::std::mem::offset_of!(OBRect, width) - 8usize];
    ["Offset of field: OBRect::height"][::std::mem::offset_of!(OBRect, height) - 12usize];
};
#[doc = "@brief Rectangle"]
pub type ob_rect = OBRect;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of format conversion types"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBConvertFormat {
    #[doc = "YUYV to RGB"]
    YuyvToRgb = 0,
    #[doc = "I420 to RGB"]
    I420ToRgb = 1,
    #[doc = "NV21 to RGB"]
    Nv21ToRgb = 2,
    #[doc = "NV12 to RGB"]
    Nv12ToRgb = 3,
    #[doc = "MJPG to I420"]
    MjpgToI420 = 4,
    #[doc = "RGB888 to BGR"]
    RgbToBgr = 5,
    #[doc = "MJPG to NV21"]
    MjpgToNv21 = 6,
    #[doc = "MJPG to RGB"]
    MjpgToRgb = 7,
    #[doc = "MJPG to BGR"]
    MjpgToBgr = 8,
    #[doc = "MJPG to BGRA"]
    MjpgToBgra = 9,
    #[doc = "UYVY to RGB"]
    UyvyToRgb = 10,
    #[doc = "BGR to RGB"]
    BgrToRgb = 11,
    #[doc = "MJPG to NV12"]
    MjpgToNv12 = 12,
    #[doc = "YUYV to BGR"]
    YuyvToBgr = 13,
    #[doc = "YUYV to RGBA"]
    YuyvToRgba = 14,
    #[doc = "YUYV to BGRA"]
    YuyvToBgra = 15,
    #[doc = "YUYV to Y16"]
    YuyvToY16 = 16,
    #[doc = "YUYV to Y8"]
    YuyvToY8 = 17,
    #[doc = "RGBA to RGB"]
    RgbaToRgb = 18,
    #[doc = "BGRA to BGR"]
    BgraToBgr = 19,
    #[doc = "Y16 to RGB"]
    Y16ToRgb = 20,
    #[doc = "Y8 to RGB"]
    Y8ToRgb = 21,
}
#[doc = "@brief Enumeration of format conversion types"]
pub use self::OBConvertFormat as ob_convert_format;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of IMU sample rate values (gyroscope or accelerometer)"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBAccelSampleRate {
    RateUnknown = 0,
    #[doc = "1.5625Hz"]
    Rate15625Hz = 1,
    #[doc = "3.125Hz"]
    Rate3125Hz = 2,
    #[doc = "6.25Hz"]
    Rate625Hz = 3,
    #[doc = "12.5Hz"]
    Rate125Hz = 4,
    #[doc = "25Hz"]
    Rate25Hz = 5,
    #[doc = "50Hz"]
    Rate50Hz = 6,
    #[doc = "100Hz"]
    Rate100Hz = 7,
    #[doc = "200Hz"]
    Rate200Hz = 8,
    #[doc = "500Hz"]
    Rate500Hz = 9,
    #[doc = "1KHz"]
    Rate1Khz = 10,
    #[doc = "2KHz"]
    Rate2Khz = 11,
    #[doc = "4KHz"]
    Rate4Khz = 12,
    #[doc = "8KHz"]
    Rate8Khz = 13,
    #[doc = "16KHz"]
    Rate16Khz = 14,
    #[doc = "32Hz"]
    Rate32Khz = 15,
    #[doc = "400Hz"]
    Rate400Hz = 16,
    #[doc = "800Hz"]
    Rate800Hz = 17,
}
#[doc = "@brief Enumeration of IMU sample rate values (gyroscope or accelerometer)"]
pub use self::OBAccelSampleRate as OBGyroSampleRate;
#[doc = "@brief Enumeration of IMU sample rate values (gyroscope or accelerometer)"]
pub use self::OBAccelSampleRate as ob_gyro_sample_rate;
#[doc = "@brief Enumeration of IMU sample rate values (gyroscope or accelerometer)"]
pub use self::OBAccelSampleRate as ob_accel_sample_rate;
#[doc = "@brief Enumeration of IMU sample rate values (gyroscope or accelerometer)"]
pub use self::OBAccelSampleRate as OB_SAMPLE_RATE;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of gyroscope ranges"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBGyroFullScaleRange {
    FsUnknown = -1,
    #[doc = "16 degrees per second"]
    Fs16Dps = 1,
    #[doc = "31 degrees per second"]
    Fs31Dps = 2,
    #[doc = "62 degrees per second"]
    Fs62Dps = 3,
    #[doc = "125 degrees per second"]
    Fs125Dps = 4,
    #[doc = "250 degrees per second"]
    Fs250Dps = 5,
    #[doc = "500 degrees per second"]
    Fs500Dps = 6,
    #[doc = "1000 degrees per second"]
    Fs1000Dps = 7,
    #[doc = "2000 degrees per second"]
    Fs2000Dps = 8,
    #[doc = "400 degrees per second"]
    Fs400Dps = 9,
    #[doc = "800 degrees per second"]
    Fs800Dps = 10,
}
#[doc = "@brief Enumeration of gyroscope ranges"]
pub use self::OBGyroFullScaleRange as ob_gyro_full_scale_range;
#[doc = "@brief Enumeration of gyroscope ranges"]
pub use self::OBGyroFullScaleRange as OB_GYRO_FULL_SCALE_RANGE;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of accelerometer ranges"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBAccelFullScaleRange {
    FsUnknown = -1,
    #[doc = "1x the acceleration of gravity"]
    Fs2G = 1,
    #[doc = "4x the acceleration of gravity"]
    Fs4G = 2,
    #[doc = "8x the acceleration of gravity"]
    Fs8G = 3,
    #[doc = "16x the acceleration of gravity"]
    Fs16G = 4,
    #[doc = "3x the acceleration of gravity"]
    Fs3G = 5,
    #[doc = "6x the acceleration of gravity"]
    Fs6G = 6,
    #[doc = "12x the acceleration of gravity"]
    Fs12G = 7,
    #[doc = "24x the acceleration of gravity"]
    Fs24G = 8,
}
#[doc = "@brief Enumeration of accelerometer ranges"]
pub use self::OBAccelFullScaleRange as ob_accel_full_scale_range;
#[doc = "@brief Enumeration of accelerometer ranges"]
pub use self::OBAccelFullScaleRange as OB_ACCEL_FULL_SCALE_RANGE;
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBAccelValue {
    #[doc = "X-direction component"]
    pub x: f32,
    #[doc = "Y-direction component"]
    pub y: f32,
    #[doc = "Z-direction component"]
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBAccelValue"][::std::mem::size_of::<OBAccelValue>() - 12usize];
    ["Alignment of OBAccelValue"][::std::mem::align_of::<OBAccelValue>() - 1usize];
    ["Offset of field: OBAccelValue::x"][::std::mem::offset_of!(OBAccelValue, x) - 0usize];
    ["Offset of field: OBAccelValue::y"][::std::mem::offset_of!(OBAccelValue, y) - 4usize];
    ["Offset of field: OBAccelValue::z"][::std::mem::offset_of!(OBAccelValue, z) - 8usize];
};
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
pub type OBGyroValue = OBAccelValue;
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
pub type OBFloat3D = OBAccelValue;
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
pub type ob_accel_value = OBAccelValue;
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
pub type ob_gyro_value = OBAccelValue;
#[doc = "@brief Data structures for accelerometers and gyroscopes"]
pub type ob_float_3d = OBAccelValue;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Data structures for LiDAR scan rate"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBLiDARScanRate {
    ScanUnknown = 0,
    Scan5Hz = 1,
    Scan10Hz = 2,
    Scan15Hz = 3,
    Scan20Hz = 4,
    Scan25Hz = 5,
    Scan30Hz = 6,
    Scan40Hz = 7,
}
#[doc = "@brief Data structures for LiDAR scan rate"]
pub use self::OBLiDARScanRate as ob_lidar_scan_rate;
#[doc = "@brief Data structures for LiDAR scan rate"]
pub use self::OBLiDARScanRate as OB_LIDAR_SCAN_RATE;
#[doc = "@brief Device state"]
pub type OBDeviceState = u64;
#[doc = "@brief Device state"]
pub type ob_device_state = u64;
#[doc = "@brief Temperature parameters of the device (unit: Celsius)"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBDeviceTemperature {
    #[doc = "CPU temperature"]
    pub cpuTemp: f32,
    #[doc = "IR temperature"]
    pub irTemp: f32,
    #[doc = "Laser temperature"]
    pub ldmTemp: f32,
    #[doc = "Motherboard temperature"]
    pub mainBoardTemp: f32,
    #[doc = "TEC temperature"]
    pub tecTemp: f32,
    #[doc = "IMU temperature"]
    pub imuTemp: f32,
    #[doc = "RGB temperature"]
    pub rgbTemp: f32,
    #[doc = "Left IR temperature"]
    pub irLeftTemp: f32,
    #[doc = "Right IR temperature"]
    pub irRightTemp: f32,
    #[doc = "MX6600 top temperature"]
    pub chipTopTemp: f32,
    #[doc = "MX6600 bottom temperature"]
    pub chipBottomTemp: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDeviceTemperature"][::std::mem::size_of::<OBDeviceTemperature>() - 44usize];
    ["Alignment of OBDeviceTemperature"][::std::mem::align_of::<OBDeviceTemperature>() - 1usize];
    ["Offset of field: OBDeviceTemperature::cpuTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, cpuTemp) - 0usize];
    ["Offset of field: OBDeviceTemperature::irTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, irTemp) - 4usize];
    ["Offset of field: OBDeviceTemperature::ldmTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, ldmTemp) - 8usize];
    ["Offset of field: OBDeviceTemperature::mainBoardTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, mainBoardTemp) - 12usize];
    ["Offset of field: OBDeviceTemperature::tecTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, tecTemp) - 16usize];
    ["Offset of field: OBDeviceTemperature::imuTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, imuTemp) - 20usize];
    ["Offset of field: OBDeviceTemperature::rgbTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, rgbTemp) - 24usize];
    ["Offset of field: OBDeviceTemperature::irLeftTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, irLeftTemp) - 28usize];
    ["Offset of field: OBDeviceTemperature::irRightTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, irRightTemp) - 32usize];
    ["Offset of field: OBDeviceTemperature::chipTopTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, chipTopTemp) - 36usize];
    ["Offset of field: OBDeviceTemperature::chipBottomTemp"]
        [::std::mem::offset_of!(OBDeviceTemperature, chipBottomTemp) - 40usize];
};
#[doc = "@brief Temperature parameters of the device (unit: Celsius)"]
pub type ob_device_temperature = OBDeviceTemperature;
#[doc = "@brief Temperature parameters of the device (unit: Celsius)"]
pub type DEVICE_TEMPERATURE = OBDeviceTemperature;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for depth crop modes"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDepthCroppingMode {
    #[doc = "Automatic mode"]
    Auto = 0,
    #[doc = "Close crop"]
    Close = 1,
    #[doc = "Open crop"]
    Open = 2,
}
#[doc = "@brief Enumeration for depth crop modes"]
pub use self::OBDepthCroppingMode as ob_depth_cropping_mode;
#[doc = "@brief Enumeration for depth crop modes"]
pub use self::OBDepthCroppingMode as OB_DEPTH_CROPPING_MODE;
#[repr(i32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for device types"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDeviceType {
    #[doc = "Unknown device type"]
    DeviceTypeUnknown = -1,
    #[doc = "Monocular structured light camera"]
    StructuredLightMonocularCamera = 0,
    #[doc = "Binocular structured light camera"]
    StructuredLightBinocularCamera = 1,
    #[doc = "Time-of-flight camera"]
    TofCamera = 2,
}
#[doc = "@brief Enumeration for device types"]
pub use self::OBDeviceType as ob_device_type;
#[doc = "@brief Enumeration for device types"]
pub use self::OBDeviceType as OB_DEVICE_TYPE;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for types of media to record or playback"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBMediaType {
    #[doc = "Color stream"]
    ColorStream = 1,
    #[doc = "Depth stream"]
    DepthStream = 2,
    #[doc = "Infrared stream"]
    IrStream = 4,
    #[doc = "Gyroscope stream"]
    GyroStream = 8,
    #[doc = "Accelerometer stream"]
    AccelStream = 16,
    #[doc = "Camera parameter"]
    CameraParam = 32,
    #[doc = "Device information"]
    DeviceInfo = 64,
    #[doc = "Stream information"]
    StreamInfo = 128,
    #[doc = "Left infrared stream"]
    IrLeftStream = 256,
    #[doc = "Right infrared stream"]
    IrRightStream = 512,
    All = 1023,
}
#[doc = "@brief Enumeration for types of media to record or playback"]
pub use self::OBMediaType as ob_media_type;
#[doc = "@brief Enumeration for types of media to record or playback"]
pub use self::OBMediaType as OB_MEDIA_TYPE;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for record playback status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBMediaState {
    #[doc = "Begin"]
    Begin = 0,
    #[doc = "Pause"]
    Pause = 1,
    #[doc = "Resume"]
    Resume = 2,
    #[doc = "End"]
    End = 3,
}
#[doc = "@brief Enumeration for record playback status"]
pub use self::OBMediaState as ob_media_state;
#[doc = "@brief Enumeration for record playback status"]
pub use self::OBMediaState as OB_MEDIA_STATE_EM;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for depth precision levels\n @attention The depth precision level does not completely determine the depth unit and real precision, and the influence of the data packaging format needs to\n be considered. The specific unit can be obtained through getValueScale() of DepthFrame"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDepthUnit {
    #[doc = "1mm"]
    Precision1Mm = 0,
    #[doc = "0.8mm"]
    Precision0Mm8 = 1,
    #[doc = "0.4mm"]
    Precision0Mm4 = 2,
    #[doc = "0.1mm"]
    Precision0Mm1 = 3,
    #[doc = "0.2mm"]
    Precision0Mm2 = 4,
    #[doc = "0.5mm"]
    Precision0Mm5 = 5,
    #[doc = "0.05mm"]
    Precision0Mm05 = 6,
    PrecisionUnknown = 7,
    PrecisionCount = 8,
}
#[doc = "@brief Enumeration for depth precision levels\n @attention The depth precision level does not completely determine the depth unit and real precision, and the influence of the data packaging format needs to\n be considered. The specific unit can be obtained through getValueScale() of DepthFrame"]
pub use self::OBDepthUnit as ob_depth_precision_level;
#[doc = "@brief Enumeration for depth precision levels\n @attention The depth precision level does not completely determine the depth unit and real precision, and the influence of the data packaging format needs to\n be considered. The specific unit can be obtained through getValueScale() of DepthFrame"]
pub use self::OBDepthUnit as OB_DEPTH_PRECISION_LEVEL;
#[doc = "@brief Enumeration for depth precision levels\n @attention The depth precision level does not completely determine the depth unit and real precision, and the influence of the data packaging format needs to\n be considered. The specific unit can be obtained through getValueScale() of DepthFrame"]
pub use self::OBDepthUnit as ob_depth_unit;
#[doc = "@brief disparity parameters for disparity based camera"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBDisparityParam {
    pub zpd: f64,
    pub zpps: f64,
    pub baseline: f32,
    pub fx: f64,
    pub bitSize: u8,
    pub unit: f32,
    pub minDisparity: f32,
    pub packMode: u8,
    pub dispOffset: f32,
    pub invalidDisp: i32,
    pub dispIntPlace: i32,
    pub isDualCamera: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDisparityParam"][::std::mem::size_of::<OBDisparityParam>() - 51usize];
    ["Alignment of OBDisparityParam"][::std::mem::align_of::<OBDisparityParam>() - 1usize];
    ["Offset of field: OBDisparityParam::zpd"]
        [::std::mem::offset_of!(OBDisparityParam, zpd) - 0usize];
    ["Offset of field: OBDisparityParam::zpps"]
        [::std::mem::offset_of!(OBDisparityParam, zpps) - 8usize];
    ["Offset of field: OBDisparityParam::baseline"]
        [::std::mem::offset_of!(OBDisparityParam, baseline) - 16usize];
    ["Offset of field: OBDisparityParam::fx"]
        [::std::mem::offset_of!(OBDisparityParam, fx) - 20usize];
    ["Offset of field: OBDisparityParam::bitSize"]
        [::std::mem::offset_of!(OBDisparityParam, bitSize) - 28usize];
    ["Offset of field: OBDisparityParam::unit"]
        [::std::mem::offset_of!(OBDisparityParam, unit) - 29usize];
    ["Offset of field: OBDisparityParam::minDisparity"]
        [::std::mem::offset_of!(OBDisparityParam, minDisparity) - 33usize];
    ["Offset of field: OBDisparityParam::packMode"]
        [::std::mem::offset_of!(OBDisparityParam, packMode) - 37usize];
    ["Offset of field: OBDisparityParam::dispOffset"]
        [::std::mem::offset_of!(OBDisparityParam, dispOffset) - 38usize];
    ["Offset of field: OBDisparityParam::invalidDisp"]
        [::std::mem::offset_of!(OBDisparityParam, invalidDisp) - 42usize];
    ["Offset of field: OBDisparityParam::dispIntPlace"]
        [::std::mem::offset_of!(OBDisparityParam, dispIntPlace) - 46usize];
    ["Offset of field: OBDisparityParam::isDualCamera"]
        [::std::mem::offset_of!(OBDisparityParam, isDualCamera) - 50usize];
};
#[doc = "@brief disparity parameters for disparity based camera"]
pub type ob_disparity_param = OBDisparityParam;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration for TOF filter scene ranges"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBTofFilterRange {
    #[doc = "Close range"]
    Close = 0,
    #[doc = "Middle range"]
    Middle = 1,
    #[doc = "Long range"]
    Long = 2,
    #[doc = "Debug range"]
    Debug = 100,
}
#[doc = "@brief Enumeration for TOF filter scene ranges"]
pub use self::OBTofFilterRange as ob_tof_filter_range;
#[doc = "@brief Enumeration for TOF filter scene ranges"]
pub use self::OBTofFilterRange as TOF_FILTER_RANGE;
#[doc = "@brief 3D point structure in the SDK"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBPoint {
    #[doc = "X coordinate"]
    pub x: f32,
    #[doc = "Y coordinate"]
    pub y: f32,
    #[doc = "Z coordinate"]
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBPoint"][::std::mem::size_of::<OBPoint>() - 12usize];
    ["Alignment of OBPoint"][::std::mem::align_of::<OBPoint>() - 1usize];
    ["Offset of field: OBPoint::x"][::std::mem::offset_of!(OBPoint, x) - 0usize];
    ["Offset of field: OBPoint::y"][::std::mem::offset_of!(OBPoint, y) - 4usize];
    ["Offset of field: OBPoint::z"][::std::mem::offset_of!(OBPoint, z) - 8usize];
};
#[doc = "@brief 3D point structure in the SDK"]
pub type ob_point = OBPoint;
#[doc = "@brief 3D point structure in the SDK"]
pub type OBPoint3f = OBPoint;
#[doc = "@brief 3D point structure in the SDK"]
pub type ob_point3f = OBPoint;
#[doc = "@brief 2D point structure in the SDK"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBPoint2f {
    #[doc = "X coordinate"]
    pub x: f32,
    #[doc = "Y coordinate"]
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBPoint2f"][::std::mem::size_of::<OBPoint2f>() - 8usize];
    ["Alignment of OBPoint2f"][::std::mem::align_of::<OBPoint2f>() - 1usize];
    ["Offset of field: OBPoint2f::x"][::std::mem::offset_of!(OBPoint2f, x) - 0usize];
    ["Offset of field: OBPoint2f::y"][::std::mem::offset_of!(OBPoint2f, y) - 4usize];
};
#[doc = "@brief 2D point structure in the SDK"]
pub type ob_point2f = OBPoint2f;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBXYTables {
    #[doc = "table used to compute X coordinate"]
    pub xTable: *mut f32,
    #[doc = "table used to compute Y coordinate"]
    pub yTable: *mut f32,
    #[doc = "width of x and y tables"]
    pub width: ::std::os::raw::c_int,
    #[doc = "height of x and y tables"]
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBXYTables"][::std::mem::size_of::<OBXYTables>() - 24usize];
    ["Alignment of OBXYTables"][::std::mem::align_of::<OBXYTables>() - 1usize];
    ["Offset of field: OBXYTables::xTable"][::std::mem::offset_of!(OBXYTables, xTable) - 0usize];
    ["Offset of field: OBXYTables::yTable"][::std::mem::offset_of!(OBXYTables, yTable) - 8usize];
    ["Offset of field: OBXYTables::width"][::std::mem::offset_of!(OBXYTables, width) - 16usize];
    ["Offset of field: OBXYTables::height"][::std::mem::offset_of!(OBXYTables, height) - 20usize];
};
pub type ob_xy_tables = OBXYTables;
#[doc = "@brief 3D point structure with color information"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBColorPoint {
    #[doc = "X coordinate"]
    pub x: f32,
    #[doc = "Y coordinate"]
    pub y: f32,
    #[doc = "Z coordinate"]
    pub z: f32,
    #[doc = "Red channel component"]
    pub r: f32,
    #[doc = "Green channel component"]
    pub g: f32,
    #[doc = "Blue channel component"]
    pub b: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBColorPoint"][::std::mem::size_of::<OBColorPoint>() - 24usize];
    ["Alignment of OBColorPoint"][::std::mem::align_of::<OBColorPoint>() - 1usize];
    ["Offset of field: OBColorPoint::x"][::std::mem::offset_of!(OBColorPoint, x) - 0usize];
    ["Offset of field: OBColorPoint::y"][::std::mem::offset_of!(OBColorPoint, y) - 4usize];
    ["Offset of field: OBColorPoint::z"][::std::mem::offset_of!(OBColorPoint, z) - 8usize];
    ["Offset of field: OBColorPoint::r"][::std::mem::offset_of!(OBColorPoint, r) - 12usize];
    ["Offset of field: OBColorPoint::g"][::std::mem::offset_of!(OBColorPoint, g) - 16usize];
    ["Offset of field: OBColorPoint::b"][::std::mem::offset_of!(OBColorPoint, b) - 20usize];
};
#[doc = "@brief 3D point structure with color information"]
pub type ob_color_point = OBColorPoint;
#[doc = "@brief 3D point structure with LiDAR information"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBLiDARScanPoint {
    #[doc = "angle, unit: degrees"]
    pub angle: f32,
    #[doc = "distance, unit: mm"]
    pub distance: f32,
    #[doc = "intensity, 0~2000"]
    pub intensity: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBLiDARScanPoint"][::std::mem::size_of::<OBLiDARScanPoint>() - 10usize];
    ["Alignment of OBLiDARScanPoint"][::std::mem::align_of::<OBLiDARScanPoint>() - 1usize];
    ["Offset of field: OBLiDARScanPoint::angle"]
        [::std::mem::offset_of!(OBLiDARScanPoint, angle) - 0usize];
    ["Offset of field: OBLiDARScanPoint::distance"]
        [::std::mem::offset_of!(OBLiDARScanPoint, distance) - 4usize];
    ["Offset of field: OBLiDARScanPoint::intensity"]
        [::std::mem::offset_of!(OBLiDARScanPoint, intensity) - 8usize];
};
#[doc = "@brief 3D point structure with LiDAR information"]
pub type ob_lidar_scan_point = OBLiDARScanPoint;
#[doc = "@brief 3D point structure with LiDAR information"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBLiDARPoint {
    #[doc = "X coordinate, unit mm"]
    pub x: f32,
    #[doc = "Y coordinate, unit mm"]
    pub y: f32,
    #[doc = "Z coordinate, unit mm"]
    pub z: f32,
    #[doc = "reflectivity"]
    pub reflectivity: u8,
    #[doc = "point state"]
    pub tag: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBLiDARPoint"][::std::mem::size_of::<OBLiDARPoint>() - 14usize];
    ["Alignment of OBLiDARPoint"][::std::mem::align_of::<OBLiDARPoint>() - 1usize];
    ["Offset of field: OBLiDARPoint::x"][::std::mem::offset_of!(OBLiDARPoint, x) - 0usize];
    ["Offset of field: OBLiDARPoint::y"][::std::mem::offset_of!(OBLiDARPoint, y) - 4usize];
    ["Offset of field: OBLiDARPoint::z"][::std::mem::offset_of!(OBLiDARPoint, z) - 8usize];
    ["Offset of field: OBLiDARPoint::reflectivity"]
        [::std::mem::offset_of!(OBLiDARPoint, reflectivity) - 12usize];
    ["Offset of field: OBLiDARPoint::tag"][::std::mem::offset_of!(OBLiDARPoint, tag) - 13usize];
};
#[doc = "@brief 3D point structure with LiDAR information"]
pub type ob_lidar_point = OBLiDARPoint;
#[doc = "@brief 3D point structure with LiDAR information"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBLiDARSpherePoint {
    #[doc = "distance, unit: mm"]
    pub distance: f32,
    #[doc = "azimuth angle, unit: degrees"]
    pub theta: f32,
    #[doc = "zenith angle, unit: degrees"]
    pub phi: f32,
    #[doc = "reflectivity"]
    pub reflectivity: u8,
    #[doc = "tag"]
    pub tag: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBLiDARSpherePoint"][::std::mem::size_of::<OBLiDARSpherePoint>() - 14usize];
    ["Alignment of OBLiDARSpherePoint"][::std::mem::align_of::<OBLiDARSpherePoint>() - 1usize];
    ["Offset of field: OBLiDARSpherePoint::distance"]
        [::std::mem::offset_of!(OBLiDARSpherePoint, distance) - 0usize];
    ["Offset of field: OBLiDARSpherePoint::theta"]
        [::std::mem::offset_of!(OBLiDARSpherePoint, theta) - 4usize];
    ["Offset of field: OBLiDARSpherePoint::phi"]
        [::std::mem::offset_of!(OBLiDARSpherePoint, phi) - 8usize];
    ["Offset of field: OBLiDARSpherePoint::reflectivity"]
        [::std::mem::offset_of!(OBLiDARSpherePoint, reflectivity) - 12usize];
    ["Offset of field: OBLiDARSpherePoint::tag"]
        [::std::mem::offset_of!(OBLiDARSpherePoint, tag) - 13usize];
};
#[doc = "@brief 3D point structure with LiDAR information"]
pub type ob_lidar_sphere_point = OBLiDARSpherePoint;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Compression mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCompressionMode {
    #[doc = "Lossless compression mode"]
    Lossless = 0,
    #[doc = "Lossy compression mode"]
    Lossy = 1,
}
#[doc = "@brief Compression mode"]
pub use self::OBCompressionMode as ob_compression_mode;
#[doc = "@brief Compression mode"]
pub use self::OBCompressionMode as OB_COMPRESSION_MODE;
#[doc = "Compression Params"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBCompressionParams {
    #[doc = "Lossy compression threshold, range [0~255], recommended value is 9, the higher the threshold, the higher the compression ratio."]
    pub threshold: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBCompressionParams"][::std::mem::size_of::<OBCompressionParams>() - 4usize];
    ["Alignment of OBCompressionParams"][::std::mem::align_of::<OBCompressionParams>() - 1usize];
    ["Offset of field: OBCompressionParams::threshold"]
        [::std::mem::offset_of!(OBCompressionParams, threshold) - 0usize];
};
#[doc = "Compression Params"]
pub type ob_compression_params = OBCompressionParams;
#[doc = "Compression Params"]
pub type OB_COMPRESSION_PARAMS = OBCompressionParams;
#[doc = "@brief TOF Exposure Threshold"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBTofExposureThresholdControl {
    #[doc = "Upper threshold, unit: ms"]
    pub upper: i32,
    #[doc = "Lower threshold, unit: ms"]
    pub lower: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBTofExposureThresholdControl"]
        [::std::mem::size_of::<OBTofExposureThresholdControl>() - 8usize];
    ["Alignment of OBTofExposureThresholdControl"]
        [::std::mem::align_of::<OBTofExposureThresholdControl>() - 1usize];
    ["Offset of field: OBTofExposureThresholdControl::upper"]
        [::std::mem::offset_of!(OBTofExposureThresholdControl, upper) - 0usize];
    ["Offset of field: OBTofExposureThresholdControl::lower"]
        [::std::mem::offset_of!(OBTofExposureThresholdControl, lower) - 4usize];
};
#[doc = "@brief TOF Exposure Threshold"]
pub type ob_tof_exposure_threshold_control = OBTofExposureThresholdControl;
#[doc = "@brief TOF Exposure Threshold"]
pub type TOF_EXPOSURE_THRESHOLD_CONTROL = OBTofExposureThresholdControl;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Sync mode\n @deprecated This define is deprecated, please use @ref ob_multi_device_sync_mode instead"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBSyncMode {
    #[doc = "@brief Close synchronize mode\n @brief Single device, neither process input trigger signal nor output trigger signal\n @brief Each Sensor in a single device automatically triggers"]
    Close = 0,
    #[doc = "@brief Standalone synchronize mode\n @brief Single device, neither process input trigger signal nor output trigger signal\n @brief Inside single device, RGB as Major sensor: RGB -> IR/Depth/TOF"]
    Standalone = 1,
    #[doc = "@brief Primary synchronize mode\n @brief Primary device. Ignore process input trigger signal, only output trigger signal to secondary devices.\n @brief Inside single device, RGB as Major sensor: RGB -> IR/Depth/TOF"]
    Primary = 2,
    #[doc = "@brief Secondary synchronize mode\n @brief Secondary device. Both process input trigger signal and output trigger signal to other devices.\n @brief Different sensors in a single devices receive trigger signals respectively: ext trigger -> RGB && ext trigger -> IR/Depth/TOF\n\n @attention With the current Gemini 2 device set to this mode, each Sensor receives the first external trigger signal\n     after the stream is turned on and starts timing self-triggering at the set frame rate until the stream is turned off"]
    Secondary = 3,
    #[doc = "@brief MCU Primary synchronize mode\n @brief Primary device. Ignore process input trigger signal, only output trigger signal to secondary devices.\n @brief Inside device, MCU is the primary signal source:  MCU -> RGB && MCU -> IR/Depth/TOF"]
    PrimaryMcuTrigger = 4,
    #[doc = "@brief IR Primary synchronize mode\n @brief Primary device. Ignore process input trigger signal, only output trigger signal to secondary devices.\n @brief Inside device, IR is the primary signal source: IR/Depth/TOF -> RGB"]
    PrimaryIrTrigger = 5,
    #[doc = "@brief Software trigger synchronize mode\n @brief Host, triggered by software control (receive the upper computer command trigger), at the same time to the trunk output trigger signal\n @brief Different sensors in a single machine receive trigger signals respectively: soft trigger -> RGB && soft trigger -> IR/Depth/TOF\n\n @attention Support product: Gemini2"]
    PrimarySoftTrigger = 6,
    #[doc = "@brief Software trigger synchronize mode as secondary device\n @brief The slave receives the external trigger signal (the external trigger signal comes from the soft trigger host) and outputs the trigger signal to\n the external relay.\n @brief Different sensors in a single machine receive trigger signals respectively: ext trigger -> RGB && ext  trigger -> IR/Depth/TOF"]
    SecondarySoftTrigger = 7,
    #[doc = "@brief IR and IMU sync signal"]
    IrImuSync = 8,
    #[doc = "@brief Unknown type"]
    Unknown = 255,
}
#[doc = "@brief Sync mode\n @deprecated This define is deprecated, please use @ref ob_multi_device_sync_mode instead"]
pub use self::OBSyncMode as ob_sync_mode;
#[doc = "@brief Sync mode\n @deprecated This define is deprecated, please use @ref ob_multi_device_sync_mode instead"]
pub use self::OBSyncMode as OB_SYNC_MODE;
#[doc = "@brief Device synchronization configuration\n @deprecated This structure is deprecated, please use @ref ob_multi_device_sync_config instead"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBDeviceSyncConfig {
    #[doc = "@brief Device synchronize mode"]
    pub syncMode: OBSyncMode,
    #[doc = "@brief IR Trigger signal input delay: Used to configure the delay between the IR/Depth/TOF Sensor receiving the trigger signal and starting exposure,\n Unit: microsecond\n\n @attention This parameter is invalid when the synchronization MODE is set to @ref OB_SYNC_MODE_PRIMARY_IR_TRIGGER"]
    pub irTriggerSignalInDelay: u16,
    #[doc = "@brief RGB trigger signal input delay is used to configure the delay from the time when an RGB Sensor receives the trigger signal to the time when the\n exposure starts. Unit: microsecond\n\n @attention This parameter is invalid when the synchronization MODE is set to @ref OB_SYNC_MODE_PRIMARY"]
    pub rgbTriggerSignalInDelay: u16,
    #[doc = "@brief Device trigger signal output delay, used to control the delay configuration of the host device to output trigger signals or the slave device to\n output trigger signals. Unit: microsecond\n\n @attention This parameter is invalid when the synchronization MODE is set to @ref OB_SYNC_MODE_CLOSE or @ref OB_SYNC_MODE_STANDALONE"]
    pub deviceTriggerSignalOutDelay: u16,
    #[doc = "@brief The device trigger signal output polarity is used to control the polarity configuration of the trigger signal output from the host device or the\n trigger signal output from the slave device\n @brief 0: forward pulse; 1: negative pulse\n\n @attention This parameter is invalid when the synchronization MODE is set to @ref OB_SYNC_MODE_CLOSE or @ref OB_SYNC_MODE_STANDALONE"]
    pub deviceTriggerSignalOutPolarity: u16,
    #[doc = "@brief MCU trigger frequency, used to configure the output frequency of MCU trigger signal in MCU master mode, unit: Hz\n @brief This configuration will directly affect the image output frame rate of the Sensor. Unit: FPS (frames per second)\n\n @attention This parameter is invalid only when the synchronization MODE is set to @ref OB_SYNC_MODE_PRIMARY_MCU_TRIGGER"]
    pub mcuTriggerFrequency: u16,
    #[doc = "@brief Device number. Users can mark the device with this number"]
    pub deviceId: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDeviceSyncConfig"][::std::mem::size_of::<OBDeviceSyncConfig>() - 16usize];
    ["Alignment of OBDeviceSyncConfig"][::std::mem::align_of::<OBDeviceSyncConfig>() - 1usize];
    ["Offset of field: OBDeviceSyncConfig::syncMode"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, syncMode) - 0usize];
    ["Offset of field: OBDeviceSyncConfig::irTriggerSignalInDelay"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, irTriggerSignalInDelay) - 4usize];
    ["Offset of field: OBDeviceSyncConfig::rgbTriggerSignalInDelay"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, rgbTriggerSignalInDelay) - 6usize];
    ["Offset of field: OBDeviceSyncConfig::deviceTriggerSignalOutDelay"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, deviceTriggerSignalOutDelay) - 8usize];
    ["Offset of field: OBDeviceSyncConfig::deviceTriggerSignalOutPolarity"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, deviceTriggerSignalOutPolarity) - 10usize];
    ["Offset of field: OBDeviceSyncConfig::mcuTriggerFrequency"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, mcuTriggerFrequency) - 12usize];
    ["Offset of field: OBDeviceSyncConfig::deviceId"]
        [::std::mem::offset_of!(OBDeviceSyncConfig, deviceId) - 14usize];
};
#[doc = "@brief Device synchronization configuration\n @deprecated This structure is deprecated, please use @ref ob_multi_device_sync_config instead"]
pub type ob_device_sync_config = OBDeviceSyncConfig;
#[doc = "@brief Device synchronization configuration\n @deprecated This structure is deprecated, please use @ref ob_multi_device_sync_config instead"]
pub type OB_DEVICE_SYNC_CONFIG = OBDeviceSyncConfig;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Preset tag"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDepthWorkModeTag {
    DeviceDepthWorkMode = 0,
    CustomDepthWorkMode = 1,
}
#[doc = "@brief Preset tag"]
pub use self::OBDepthWorkModeTag as ob_depth_work_mode_tag;
#[doc = "@brief Depth work mode"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBDepthWorkMode {
    #[doc = "@brief Checksum of work mode"]
    pub checksum: [u8; 16usize],
    #[doc = "@brief Name of work mode"]
    pub name: [::std::os::raw::c_char; 32usize],
    #[doc = "@brief Preset tag"]
    pub tag: OBDepthWorkModeTag,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDepthWorkMode"][::std::mem::size_of::<OBDepthWorkMode>() - 52usize];
    ["Alignment of OBDepthWorkMode"][::std::mem::align_of::<OBDepthWorkMode>() - 1usize];
    ["Offset of field: OBDepthWorkMode::checksum"]
        [::std::mem::offset_of!(OBDepthWorkMode, checksum) - 0usize];
    ["Offset of field: OBDepthWorkMode::name"]
        [::std::mem::offset_of!(OBDepthWorkMode, name) - 16usize];
    ["Offset of field: OBDepthWorkMode::tag"]
        [::std::mem::offset_of!(OBDepthWorkMode, tag) - 48usize];
};
#[doc = "@brief Depth work mode"]
pub type ob_depth_work_mode = OBDepthWorkMode;
#[doc = "@brief SequenceId fliter list item"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBSequenceIdItem {
    pub sequenceSelectId: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBSequenceIdItem"][::std::mem::size_of::<OBSequenceIdItem>() - 12usize];
    ["Alignment of OBSequenceIdItem"][::std::mem::align_of::<OBSequenceIdItem>() - 1usize];
    ["Offset of field: OBSequenceIdItem::sequenceSelectId"]
        [::std::mem::offset_of!(OBSequenceIdItem, sequenceSelectId) - 0usize];
    ["Offset of field: OBSequenceIdItem::name"]
        [::std::mem::offset_of!(OBSequenceIdItem, name) - 4usize];
};
#[doc = "@brief SequenceId fliter list item"]
pub type ob_sequence_id_item = OBSequenceIdItem;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Hole fillig mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBHoleFillingMode {
    Top = 0,
    Nearest = 1,
    Farthest = 2,
}
#[doc = "@brief Hole fillig mode"]
pub use self::OBHoleFillingMode as ob_hole_filling_mode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBSpatialFastFilterParams {
    pub radius: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBSpatialFastFilterParams"]
        [::std::mem::size_of::<OBSpatialFastFilterParams>() - 1usize];
    ["Alignment of OBSpatialFastFilterParams"]
        [::std::mem::align_of::<OBSpatialFastFilterParams>() - 1usize];
    ["Offset of field: OBSpatialFastFilterParams::radius"]
        [::std::mem::offset_of!(OBSpatialFastFilterParams, radius) - 0usize];
};
pub type ob_spatial_fast_filter_params = OBSpatialFastFilterParams;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBSpatialModerateFilterParams {
    pub radius: u8,
    pub magnitude: u8,
    pub disp_diff: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBSpatialModerateFilterParams"]
        [::std::mem::size_of::<OBSpatialModerateFilterParams>() - 4usize];
    ["Alignment of OBSpatialModerateFilterParams"]
        [::std::mem::align_of::<OBSpatialModerateFilterParams>() - 1usize];
    ["Offset of field: OBSpatialModerateFilterParams::radius"]
        [::std::mem::offset_of!(OBSpatialModerateFilterParams, radius) - 0usize];
    ["Offset of field: OBSpatialModerateFilterParams::magnitude"]
        [::std::mem::offset_of!(OBSpatialModerateFilterParams, magnitude) - 1usize];
    ["Offset of field: OBSpatialModerateFilterParams::disp_diff"]
        [::std::mem::offset_of!(OBSpatialModerateFilterParams, disp_diff) - 2usize];
};
pub type ob_spatial_moderate_filter_params = OBSpatialModerateFilterParams;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBSpatialAdvancedFilterParams {
    pub magnitude: u8,
    pub alpha: f32,
    pub disp_diff: u16,
    pub radius: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBSpatialAdvancedFilterParams"]
        [::std::mem::size_of::<OBSpatialAdvancedFilterParams>() - 9usize];
    ["Alignment of OBSpatialAdvancedFilterParams"]
        [::std::mem::align_of::<OBSpatialAdvancedFilterParams>() - 1usize];
    ["Offset of field: OBSpatialAdvancedFilterParams::magnitude"]
        [::std::mem::offset_of!(OBSpatialAdvancedFilterParams, magnitude) - 0usize];
    ["Offset of field: OBSpatialAdvancedFilterParams::alpha"]
        [::std::mem::offset_of!(OBSpatialAdvancedFilterParams, alpha) - 1usize];
    ["Offset of field: OBSpatialAdvancedFilterParams::disp_diff"]
        [::std::mem::offset_of!(OBSpatialAdvancedFilterParams, disp_diff) - 5usize];
    ["Offset of field: OBSpatialAdvancedFilterParams::radius"]
        [::std::mem::offset_of!(OBSpatialAdvancedFilterParams, radius) - 7usize];
};
pub type ob_spatial_advanced_filter_params = OBSpatialAdvancedFilterParams;
#[repr(u32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBEdgeNoiseRemovalType {
    MgFilter = 0,
    MghFilter = 1,
    MgaFilter = 2,
    MgcFilter = 3,
}
pub use self::OBEdgeNoiseRemovalType as ob_edge_noise_removal_type;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBEdgeNoiseRemovalFilterParams {
    pub type_: OBEdgeNoiseRemovalType,
    pub marginLeftTh: u16,
    pub marginRightTh: u16,
    pub marginTopTh: u16,
    pub marginBottomTh: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBEdgeNoiseRemovalFilterParams"]
        [::std::mem::size_of::<OBEdgeNoiseRemovalFilterParams>() - 12usize];
    ["Alignment of OBEdgeNoiseRemovalFilterParams"]
        [::std::mem::align_of::<OBEdgeNoiseRemovalFilterParams>() - 1usize];
    ["Offset of field: OBEdgeNoiseRemovalFilterParams::type_"]
        [::std::mem::offset_of!(OBEdgeNoiseRemovalFilterParams, type_) - 0usize];
    ["Offset of field: OBEdgeNoiseRemovalFilterParams::marginLeftTh"]
        [::std::mem::offset_of!(OBEdgeNoiseRemovalFilterParams, marginLeftTh) - 4usize];
    ["Offset of field: OBEdgeNoiseRemovalFilterParams::marginRightTh"]
        [::std::mem::offset_of!(OBEdgeNoiseRemovalFilterParams, marginRightTh) - 6usize];
    ["Offset of field: OBEdgeNoiseRemovalFilterParams::marginTopTh"]
        [::std::mem::offset_of!(OBEdgeNoiseRemovalFilterParams, marginTopTh) - 8usize];
    ["Offset of field: OBEdgeNoiseRemovalFilterParams::marginBottomTh"]
        [::std::mem::offset_of!(OBEdgeNoiseRemovalFilterParams, marginBottomTh) - 10usize];
};
pub type ob_edge_noise_removal_filter_params = OBEdgeNoiseRemovalFilterParams;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Denoising method"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDDONoiseRemovalType {
    Lut = 0,
    Overall = 1,
}
#[doc = "@brief Denoising method"]
pub use self::OBDDONoiseRemovalType as ob_ddo_noise_removal_type;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBNoiseRemovalFilterParams {
    pub max_size: u16,
    pub disp_diff: u16,
    pub type_: OBDDONoiseRemovalType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBNoiseRemovalFilterParams"]
        [::std::mem::size_of::<OBNoiseRemovalFilterParams>() - 8usize];
    ["Alignment of OBNoiseRemovalFilterParams"]
        [::std::mem::align_of::<OBNoiseRemovalFilterParams>() - 1usize];
    ["Offset of field: OBNoiseRemovalFilterParams::max_size"]
        [::std::mem::offset_of!(OBNoiseRemovalFilterParams, max_size) - 0usize];
    ["Offset of field: OBNoiseRemovalFilterParams::disp_diff"]
        [::std::mem::offset_of!(OBNoiseRemovalFilterParams, disp_diff) - 2usize];
    ["Offset of field: OBNoiseRemovalFilterParams::type_"]
        [::std::mem::offset_of!(OBNoiseRemovalFilterParams, type_) - 4usize];
};
pub type ob_noise_removal_filter_params = OBNoiseRemovalFilterParams;
#[doc = "@brief Control command protocol version number"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBProtocolVersion {
    #[doc = "@brief Major version number"]
    pub major: u8,
    #[doc = "@brief Minor version number"]
    pub minor: u8,
    #[doc = "@brief Patch version number"]
    pub patch: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBProtocolVersion"][::std::mem::size_of::<OBProtocolVersion>() - 3usize];
    ["Alignment of OBProtocolVersion"][::std::mem::align_of::<OBProtocolVersion>() - 1usize];
    ["Offset of field: OBProtocolVersion::major"]
        [::std::mem::offset_of!(OBProtocolVersion, major) - 0usize];
    ["Offset of field: OBProtocolVersion::minor"]
        [::std::mem::offset_of!(OBProtocolVersion, minor) - 1usize];
    ["Offset of field: OBProtocolVersion::patch"]
        [::std::mem::offset_of!(OBProtocolVersion, patch) - 2usize];
};
#[doc = "@brief Control command protocol version number"]
pub type ob_protocol_version = OBProtocolVersion;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Command version associated with property id"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCmdVersion {
    #[doc = "Version 1.0"]
    V0 = 0,
    #[doc = "Version 2.0"]
    V1 = 1,
    #[doc = "Version 3.0"]
    V2 = 2,
    #[doc = "Version 4.0"]
    V3 = 3,
    Noversion = 65534,
    #[doc = "Invalid version"]
    Invalid = 65535,
}
#[doc = "@brief Command version associated with property id"]
pub use self::OBCmdVersion as ob_cmd_version;
#[doc = "@brief IP address configuration for network devices (IPv4)"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBNetIpConfig {
    #[doc = "@brief DHCP status\n\n @note 0: static IP; 1: DHCP"]
    pub dhcp: u16,
    #[doc = "@brief IP address (IPv4, big endian: 192.168.1.10, address[0] = 192, address[1] = 168, address[2] = 1, address[3] = 10)"]
    pub address: [u8; 4usize],
    #[doc = "@brief Subnet mask (big endian)"]
    pub mask: [u8; 4usize],
    #[doc = "@brief Gateway (big endian)"]
    pub gateway: [u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBNetIpConfig"][::std::mem::size_of::<OBNetIpConfig>() - 14usize];
    ["Alignment of OBNetIpConfig"][::std::mem::align_of::<OBNetIpConfig>() - 1usize];
    ["Offset of field: OBNetIpConfig::dhcp"][::std::mem::offset_of!(OBNetIpConfig, dhcp) - 0usize];
    ["Offset of field: OBNetIpConfig::address"]
        [::std::mem::offset_of!(OBNetIpConfig, address) - 2usize];
    ["Offset of field: OBNetIpConfig::mask"][::std::mem::offset_of!(OBNetIpConfig, mask) - 6usize];
    ["Offset of field: OBNetIpConfig::gateway"]
        [::std::mem::offset_of!(OBNetIpConfig, gateway) - 10usize];
};
#[doc = "@brief IP address configuration for network devices (IPv4)"]
pub type ob_net_ip_config = OBNetIpConfig;
#[doc = "@brief IP address configuration for network devices (IPv4)"]
pub type DEVICE_IP_ADDR_CONFIG = OBNetIpConfig;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Device communication mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCommunicationType {
    #[doc = "USB"]
    Usb = 0,
    #[doc = "Ethernet"]
    Net = 1,
}
#[doc = "@brief Device communication mode"]
pub use self::OBCommunicationType as ob_communication_type;
#[doc = "@brief Device communication mode"]
pub use self::OBCommunicationType as OB_COMMUNICATION_TYPE;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief USB power status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBUSBPowerState {
    #[doc = "No plugin"]
    PowerNoPlugin = 0,
    #[doc = "5V/0.9A"]
    Power5V0A9 = 1,
    #[doc = "5V/1.5A"]
    Power5V1A5 = 2,
    #[doc = "5V/3.0A"]
    Power5V3A0 = 3,
}
#[doc = "@brief USB power status"]
pub use self::OBUSBPowerState as ob_usb_power_state;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief DC power status"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDCPowerState {
    #[doc = "No plugin"]
    NoPlugin = 0,
    #[doc = "Plugin"]
    Plugin = 1,
}
#[doc = "@brief DC power status"]
pub use self::OBDCPowerState as ob_dc_power_state;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Rotate degree"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBRotateDegreeType {
    #[doc = "Rotate 0"]
    Degree0 = 0,
    #[doc = "Rotate 90"]
    Degree90 = 90,
    #[doc = "Rotate 180"]
    Degree180 = 180,
    #[doc = "Rotate 270"]
    Degree270 = 270,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Power line frequency mode, for color camera anti-flicker configuration"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPowerLineFreqMode {
    #[doc = "Close"]
    ModeClose = 0,
    #[doc = "50Hz"]
    Mode50Hz = 1,
    #[doc = "60Hz"]
    Mode60Hz = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Frame aggregate output mode"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFrameAggregateOutputMode {
    #[doc = "@brief Only FrameSet that contains all types of data frames will be output"]
    AllTypeFrameRequire = 0,
    #[doc = "@brief Color Frame Require output mode\n @brief Suitable for Color using H264, H265 and other inter-frame encoding format open stream\n\n @attention In this mode, the user may return null when getting a non-Color type data frame from the acquired FrameSet"]
    ColorFrameRequire = 1,
    #[doc = "@brief FrameSet for any case will be output\n\n @attention In this mode, the user may return null when getting the specified type of data frame from the acquired FrameSet"]
    AnySituation = 2,
    #[doc = "@brief Disable Frame Aggreate\n\n @attention In this mode, All types of data frames will output independently."]
    Disable = 3,
}
#[doc = "@brief Frame aggregate output mode"]
pub use self::OBFrameAggregateOutputMode as ob_frame_aggregate_output_mode;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of point cloud coordinate system types"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBCoordinateSystemType {
    LeftHandCoordinateSystem = 0,
    RightHandCoordinateSystem = 1,
}
#[doc = "@brief Enumeration of point cloud coordinate system types"]
pub use self::OBCoordinateSystemType as ob_coordinate_system_type;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration of device development modes"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDeviceDevelopmentMode {
    #[doc = "@brief User mode (default mode), which provides full camera device functionality"]
    UserMode = 0,
    #[doc = "@brief Developer mode, which allows developers to access the operating system and software/hardware resources on the device directly"]
    DeveloperMode = 1,
}
#[doc = "@brief Enumeration of device development modes"]
pub use self::OBDeviceDevelopmentMode as ob_device_development_mode;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Color camera preset"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBColorPreset {
    #[doc = "@brief Suitable for standard single-color-temperature lighting environments (e.g., typical indoor white LED or office lighting).\n This strategy serves as the system's default mode to achieve a balanced and natural white balance effect."]
    Default = 0,
    #[doc = "@brief Warm Biased AWB for mixed lighting is designed for mixed illumination combining standard white light and low-CCT sources (warm/yellow/red).\n This profile applies a controlled warm bias after AWB convergence to reduce blue cast in white-lit regions and deliver a more consistent,\n warm-leaning appearance in mixed-light scenes."]
    WarmBiasedAwb = 1,
}
#[doc = "@brief Color camera preset"]
pub use self::OBColorPreset as ob_color_preset;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief The synchronization mode of the device."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBMultiDeviceSyncMode {
    #[doc = "@brief free run mode\n @brief The device does not synchronize with other devices,\n @brief The Color and Depth can be set to different frame rates."]
    FreeRun = 1,
    #[doc = "@brief standalone mode\n @brief The device does not synchronize with other devices.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized."]
    Standalone = 2,
    #[doc = "@brief primary mode\n @brief The device is the primary device in the multi-device system, it will output the trigger signal via VSYNC_OUT pin on synchronization port by\n default.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized and can be adjusted by @ref\n OBMultiDeviceSyncConfig::colorDelayUs, @ref OBMultiDeviceSyncConfig::depthDelayUs or @ref OBMultiDeviceSyncConfig::trigger2ImageDelayUs."]
    Primary = 4,
    #[doc = "@brief secondary mode\n @brief The device is the secondary device in the multi-device system, it will receive the trigger signal via VSYNC_IN pin on synchronization port. It\n will out the trigger signal via VSYNC_OUT pin on synchronization port by default.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized and can be adjusted by @ref\n OBMultiDeviceSyncConfig::colorDelayUs, @ref OBMultiDeviceSyncConfig::depthDelayUs or @ref OBMultiDeviceSyncConfig::trigger2ImageDelayUs.\n @brief After starting the stream, the device will wait for the trigger signal to start capturing images, and will stop capturing images when the trigger\n signal is stopped.\n\n @attention The frequency of the trigger signal should be same as the frame rate of the stream profile which is set when starting the stream."]
    Secondary = 8,
    #[doc = "@brief secondary synced mode\n @brief The device is the secondary device in the multi-device system, it will receive the trigger signal via VSYNC_IN pin on synchronization port. It\n will out the trigger signal via VSYNC_OUT pin on synchronization port by default.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized and can be adjusted by @ref\n OBMultiDeviceSyncConfig::colorDelayUs, @ref OBMultiDeviceSyncConfig::depthDelayUs or @ref OBMultiDeviceSyncConfig::trigger2ImageDelayUs.\n @brief After starting the stream, the device will be immediately start capturing images, and will adjust the capture time when the trigger signal is\n received to synchronize with the primary device. If the trigger signal is stopped, the device will still capture images.\n\n @attention The frequency of the trigger signal should be same as the frame rate of the stream profile which is set when starting the stream."]
    SecondarySynced = 16,
    #[doc = "@brief software triggering mode\n @brief The device will start one time image capture after receiving the capture command and will output the trigger signal via VSYNC_OUT pin by default.\n The capture command can be sent form host by call @ref ob_device_trigger_capture. The number of images captured each time can be set by @ref\n OBMultiDeviceSyncConfig::framesPerTrigger.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized and can be adjusted by @ref\n OBMultiDeviceSyncConfig::colorDelayUs, @ref OBMultiDeviceSyncConfig::depthDelayUs or @ref OBMultiDeviceSyncConfig::trigger2ImageDelayUs.\n\n @brief The frequency of the user call @ref ob_device_trigger_capture to send the capture command multiplied by the number of frames per trigger should be\n less than the frame rate of the stream profile which is set when starting the stream."]
    SoftwareTriggering = 32,
    #[doc = "@brief hardware triggering mode\n @brief The device will start one time image capture after receiving the trigger signal via VSYNC_IN pin on synchronization port and will output the\n trigger signal via VSYNC_OUT pin by default. The number of images captured each time can be set by @ref OBMultiDeviceSyncConfig::framesPerTrigger.\n @brief The Color and Depth should be set to same frame rates, the Color and Depth will be synchronized and can be adjusted by @ref\n OBMultiDeviceSyncConfig::colorDelayUs, @ref OBMultiDeviceSyncConfig::depthDelayUs or @ref OBMultiDeviceSyncConfig::trigger2ImageDelayUs.\n\n @attention The frequency of the trigger signal multiplied by the number of frames per trigger should be less than the frame rate of the stream profile\n which is set when starting the stream.\n @attention The trigger signal input via VSYNC_IN pin on synchronization port should be ouput by other device via VSYNC_OUT pin in hardware triggering\n mode or software triggering mode.\n @attention Due to different models may have different signal input requirements, please do not use different models to output trigger\n signal as input-trigger signal."]
    HardwareTriggering = 64,
    #[doc = "@brief IR and IMU sync mode"]
    IrImuSync = 128,
    #[doc = "@brief The device captures data in software synchronization mode, starting acquisition based on the system time."]
    SoftwareSynced = 256,
}
#[doc = "@brief The synchronization configuration of the device."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ob_multi_device_sync_config {
    #[doc = "@brief The sync mode of the device."]
    pub syncMode: OBMultiDeviceSyncMode,
    #[doc = "@brief The delay time of the depth image capture after receiving the capture command or trigger signal in microseconds.\n\n @attention This parameter is only valid for some models, please refer to the product manual for details."]
    pub depthDelayUs: ::std::os::raw::c_int,
    #[doc = "@brief The delay time of the color image capture after receiving the capture command or trigger signal in microseconds.\n\n @attention This parameter is only valid for some models, please refer to the product manual for details."]
    pub colorDelayUs: ::std::os::raw::c_int,
    #[doc = "@brief The delay time of the image capture after receiving the capture command or trigger signal in microseconds.\n @brief The depth and color images are captured synchronously as the product design and can not change the delay between the depth and color images.\n\n @attention For Orbbec Astra 2 device, this parameter is valid only when the @ref triggerOutDelayUs is set to 0.\n @attention This parameter is only valid for some models to replace @ref depthDelayUs and @ref colorDelayUs, please refer to the product manual for\n details."]
    pub trigger2ImageDelayUs: ::std::os::raw::c_int,
    #[doc = "@brief Trigger signal output enable flag.\n @brief After the trigger signal output is enabled, the trigger signal will be output when the capture command or trigger signal is received. User can\n adjust the delay time of the trigger signal output by @ref triggerOutDelayUs.\n\n @attention For some models, the trigger signal output is always enabled and cannot be disabled.\n @attention If device is in the @ref OB_MULTI_DEVICE_SYNC_MODE_FREE_RUN or @ref OB_MULTI_DEVICE_SYNC_MODE_STANDALONE mode, the trigger signal output is\n always disabled. Set this parameter to true will not take effect."]
    pub triggerOutEnable: bool,
    #[doc = "@brief The delay time of the trigger signal output after receiving the capture command or trigger signal in microseconds.\n\n @attention For Orbbec Astra 2 device, only supported -1 and 0. -1 means the trigger signal output delay is automatically adjusted by the device, 0 means\n the trigger signal output is disabled."]
    pub triggerOutDelayUs: ::std::os::raw::c_int,
    #[doc = "@brief The frame number of each stream after each trigger in triggering mode.\n\n @attention This parameter is only valid when the triggering mode is set to @ref OB_MULTI_DEVICE_SYNC_MODE_HARDWARE_TRIGGERING or @ref\n OB_MULTI_DEVICE_SYNC_MODE_SOFTWARE_TRIGGERING.\n @attention The trigger frequency multiplied by the number of frames per trigger cannot exceed the maximum frame rate of the stream profile which is set\n when starting the stream."]
    pub framesPerTrigger: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ob_multi_device_sync_config"]
        [::std::mem::size_of::<ob_multi_device_sync_config>() - 25usize];
    ["Alignment of ob_multi_device_sync_config"]
        [::std::mem::align_of::<ob_multi_device_sync_config>() - 1usize];
    ["Offset of field: ob_multi_device_sync_config::syncMode"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, syncMode) - 0usize];
    ["Offset of field: ob_multi_device_sync_config::depthDelayUs"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, depthDelayUs) - 4usize];
    ["Offset of field: ob_multi_device_sync_config::colorDelayUs"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, colorDelayUs) - 8usize];
    ["Offset of field: ob_multi_device_sync_config::trigger2ImageDelayUs"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, trigger2ImageDelayUs) - 12usize];
    ["Offset of field: ob_multi_device_sync_config::triggerOutEnable"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, triggerOutEnable) - 16usize];
    ["Offset of field: ob_multi_device_sync_config::triggerOutDelayUs"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, triggerOutDelayUs) - 17usize];
    ["Offset of field: ob_multi_device_sync_config::framesPerTrigger"]
        [::std::mem::offset_of!(ob_multi_device_sync_config, framesPerTrigger) - 21usize];
};
#[doc = "@brief The synchronization configuration of the device."]
pub type OBMultiDeviceSyncConfig = ob_multi_device_sync_config;
#[doc = "@brief The timestamp reset configuration of the device."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ob_device_timestamp_reset_config {
    #[doc = "@brief Whether to enable the timestamp reset function.\n @brief If the timestamp reset function is enabled, the timer for calculating the timestamp for output frames will be reset to 0 when the timestamp reset\n command or timestamp reset signal is received, and one timestamp reset signal will be output via TIMER_SYNC_OUT pin on synchronization port by default.\n The timestamp reset signal is input via TIMER_SYNC_IN pin on the synchronization port.\n\n @attention For some models, the timestamp reset function is always enabled and cannot be disabled."]
    pub enable: bool,
    #[doc = "@brief The delay time of executing the timestamp reset function after receiving the command or signal in microseconds."]
    pub timestamp_reset_delay_us: ::std::os::raw::c_int,
    #[doc = "@brief the timestamp reset signal output enable flag.\n\n @attention For some models, the timestamp reset signal output is always enabled and cannot be disabled."]
    pub timestamp_reset_signal_output_enable: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ob_device_timestamp_reset_config"]
        [::std::mem::size_of::<ob_device_timestamp_reset_config>() - 6usize];
    ["Alignment of ob_device_timestamp_reset_config"]
        [::std::mem::align_of::<ob_device_timestamp_reset_config>() - 1usize];
    ["Offset of field: ob_device_timestamp_reset_config::enable"]
        [::std::mem::offset_of!(ob_device_timestamp_reset_config, enable) - 0usize];
    ["Offset of field: ob_device_timestamp_reset_config::timestamp_reset_delay_us"][::std::mem::offset_of!(
        ob_device_timestamp_reset_config,
        timestamp_reset_delay_us
    ) - 1usize];
    ["Offset of field: ob_device_timestamp_reset_config::timestamp_reset_signal_output_enable"][::std::mem::offset_of!(
        ob_device_timestamp_reset_config,
        timestamp_reset_signal_output_enable
    )
        - 5usize];
};
#[doc = "@brief The timestamp reset configuration of the device."]
pub type OBDeviceTimestampResetConfig = ob_device_timestamp_reset_config;
#[doc = "@brief Baseline calibration parameters"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct BASELINE_CALIBRATION_PARAM {
    #[doc = "@brief Baseline length"]
    pub baseline: f32,
    #[doc = "@brief Calibration distance"]
    pub zpd: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BASELINE_CALIBRATION_PARAM"]
        [::std::mem::size_of::<BASELINE_CALIBRATION_PARAM>() - 8usize];
    ["Alignment of BASELINE_CALIBRATION_PARAM"]
        [::std::mem::align_of::<BASELINE_CALIBRATION_PARAM>() - 1usize];
    ["Offset of field: BASELINE_CALIBRATION_PARAM::baseline"]
        [::std::mem::offset_of!(BASELINE_CALIBRATION_PARAM, baseline) - 0usize];
    ["Offset of field: BASELINE_CALIBRATION_PARAM::zpd"]
        [::std::mem::offset_of!(BASELINE_CALIBRATION_PARAM, zpd) - 4usize];
};
#[doc = "@brief Baseline calibration parameters"]
pub type ob_baseline_calibration_param = BASELINE_CALIBRATION_PARAM;
#[doc = "@brief Baseline calibration parameters"]
pub type OBBaselineCalibrationParam = BASELINE_CALIBRATION_PARAM;
#[doc = "@brief HDR Configuration"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct HDR_CONFIG {
    #[doc = "@brief Enable/disable HDR, after enabling HDR, the exposure_1 and gain_1 will be used as the first exposure and gain, and the exposure_2 and gain_2 will\n be used as the second exposure and gain. The output image will be alternately exposed and gain between the first and second\n exposure and gain.\n\n @attention After enabling HDR, the auto exposure will be disabled."]
    pub enable: u8,
    #[doc = "Sequence name"]
    pub sequence_name: u8,
    #[doc = "Exposure time 1"]
    pub exposure_1: u32,
    #[doc = "Gain 1"]
    pub gain_1: u32,
    #[doc = "Exposure time 2"]
    pub exposure_2: u32,
    #[doc = "Gain 2"]
    pub gain_2: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HDR_CONFIG"][::std::mem::size_of::<HDR_CONFIG>() - 18usize];
    ["Alignment of HDR_CONFIG"][::std::mem::align_of::<HDR_CONFIG>() - 1usize];
    ["Offset of field: HDR_CONFIG::enable"][::std::mem::offset_of!(HDR_CONFIG, enable) - 0usize];
    ["Offset of field: HDR_CONFIG::sequence_name"]
        [::std::mem::offset_of!(HDR_CONFIG, sequence_name) - 1usize];
    ["Offset of field: HDR_CONFIG::exposure_1"]
        [::std::mem::offset_of!(HDR_CONFIG, exposure_1) - 2usize];
    ["Offset of field: HDR_CONFIG::gain_1"][::std::mem::offset_of!(HDR_CONFIG, gain_1) - 6usize];
    ["Offset of field: HDR_CONFIG::exposure_2"]
        [::std::mem::offset_of!(HDR_CONFIG, exposure_2) - 10usize];
    ["Offset of field: HDR_CONFIG::gain_2"][::std::mem::offset_of!(HDR_CONFIG, gain_2) - 14usize];
};
#[doc = "@brief HDR Configuration"]
pub type ob_hdr_config = HDR_CONFIG;
#[doc = "@brief HDR Configuration"]
pub type OBHdrConfig = HDR_CONFIG;
#[doc = "@brief The rect of the region of interest"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct AE_ROI {
    pub x0_left: i16,
    pub y0_top: i16,
    pub x1_right: i16,
    pub y1_bottom: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of AE_ROI"][::std::mem::size_of::<AE_ROI>() - 8usize];
    ["Alignment of AE_ROI"][::std::mem::align_of::<AE_ROI>() - 1usize];
    ["Offset of field: AE_ROI::x0_left"][::std::mem::offset_of!(AE_ROI, x0_left) - 0usize];
    ["Offset of field: AE_ROI::y0_top"][::std::mem::offset_of!(AE_ROI, y0_top) - 2usize];
    ["Offset of field: AE_ROI::x1_right"][::std::mem::offset_of!(AE_ROI, x1_right) - 4usize];
    ["Offset of field: AE_ROI::y1_bottom"][::std::mem::offset_of!(AE_ROI, y1_bottom) - 6usize];
};
#[doc = "@brief The rect of the region of interest"]
pub type ob_region_of_interest = AE_ROI;
#[doc = "@brief The rect of the region of interest"]
pub type OBRegionOfInterest = AE_ROI;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFilterConfigValueType {
    Invalid = -1,
    Int = 0,
    Float = 1,
    Boolean = 2,
}
pub use self::OBFilterConfigValueType as ob_filter_config_value_type;
#[doc = "@brief  Configuration Item for the filter"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBFilterConfigSchemaItem {
    #[doc = "Name of the configuration item"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "Value type of the configuration item"]
    pub type_: OBFilterConfigValueType,
    #[doc = "Minimum value casted to double"]
    pub min: f64,
    #[doc = "Maximum value casted to double"]
    pub max: f64,
    #[doc = "Step value casted to double"]
    pub step: f64,
    #[doc = "Default value casted to double"]
    pub def: f64,
    #[doc = "Description of the configuration item"]
    pub desc: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBFilterConfigSchemaItem"]
        [::std::mem::size_of::<OBFilterConfigSchemaItem>() - 52usize];
    ["Alignment of OBFilterConfigSchemaItem"]
        [::std::mem::align_of::<OBFilterConfigSchemaItem>() - 1usize];
    ["Offset of field: OBFilterConfigSchemaItem::name"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, name) - 0usize];
    ["Offset of field: OBFilterConfigSchemaItem::type_"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, type_) - 8usize];
    ["Offset of field: OBFilterConfigSchemaItem::min"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, min) - 12usize];
    ["Offset of field: OBFilterConfigSchemaItem::max"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, max) - 20usize];
    ["Offset of field: OBFilterConfigSchemaItem::step"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, step) - 28usize];
    ["Offset of field: OBFilterConfigSchemaItem::def"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, def) - 36usize];
    ["Offset of field: OBFilterConfigSchemaItem::desc"]
        [::std::mem::offset_of!(OBFilterConfigSchemaItem, desc) - 44usize];
};
#[doc = "@brief  Configuration Item for the filter"]
pub type ob_filter_config_schema_item = OBFilterConfigSchemaItem;
#[doc = "@brief struct of serial number"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBDeviceSerialNumber {
    pub numberStr: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDeviceSerialNumber"][::std::mem::size_of::<OBDeviceSerialNumber>() - 16usize];
    ["Alignment of OBDeviceSerialNumber"][::std::mem::align_of::<OBDeviceSerialNumber>() - 1usize];
    ["Offset of field: OBDeviceSerialNumber::numberStr"]
        [::std::mem::offset_of!(OBDeviceSerialNumber, numberStr) - 0usize];
};
#[doc = "@brief struct of serial number"]
pub type ob_device_serial_number = OBDeviceSerialNumber;
#[doc = "@brief struct of serial number"]
pub type OBSerialNumber = OBDeviceSerialNumber;
#[doc = "@brief struct of serial number"]
pub type ob_serial_number = OBDeviceSerialNumber;
#[doc = "@brief Disparity offset interleaving configuration"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBDispOffsetConfig {
    pub enable: u8,
    pub offset0: u8,
    pub offset1: u8,
    pub reserved: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBDispOffsetConfig"][::std::mem::size_of::<OBDispOffsetConfig>() - 4usize];
    ["Alignment of OBDispOffsetConfig"][::std::mem::align_of::<OBDispOffsetConfig>() - 1usize];
    ["Offset of field: OBDispOffsetConfig::enable"]
        [::std::mem::offset_of!(OBDispOffsetConfig, enable) - 0usize];
    ["Offset of field: OBDispOffsetConfig::offset0"]
        [::std::mem::offset_of!(OBDispOffsetConfig, offset0) - 1usize];
    ["Offset of field: OBDispOffsetConfig::offset1"]
        [::std::mem::offset_of!(OBDispOffsetConfig, offset1) - 2usize];
    ["Offset of field: OBDispOffsetConfig::reserved"]
        [::std::mem::offset_of!(OBDispOffsetConfig, reserved) - 3usize];
};
#[doc = "@brief Disparity offset interleaving configuration"]
pub type ob_disp_offset_config = OBDispOffsetConfig;
#[doc = "@details Defines the original resolution and hardware decimation factor."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct OBHardwareDecimationConfig {
    #[doc = "Origin width"]
    pub originWidth: u32,
    #[doc = "Origin height"]
    pub originHeight: u32,
    #[doc = "Decimation factor"]
    pub factor: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBHardwareDecimationConfig"]
        [::std::mem::size_of::<OBHardwareDecimationConfig>() - 12usize];
    ["Alignment of OBHardwareDecimationConfig"]
        [::std::mem::align_of::<OBHardwareDecimationConfig>() - 1usize];
    ["Offset of field: OBHardwareDecimationConfig::originWidth"]
        [::std::mem::offset_of!(OBHardwareDecimationConfig, originWidth) - 0usize];
    ["Offset of field: OBHardwareDecimationConfig::originHeight"]
        [::std::mem::offset_of!(OBHardwareDecimationConfig, originHeight) - 4usize];
    ["Offset of field: OBHardwareDecimationConfig::factor"]
        [::std::mem::offset_of!(OBHardwareDecimationConfig, factor) - 8usize];
};
#[doc = "@details Defines the original resolution and hardware decimation factor."]
pub type ob_hardware_decimation_config = OBHardwareDecimationConfig;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Frame metadata types\n @brief The frame metadata is a set of meta info generated by the device for current individual frame."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBFrameMetadataType {
    #[doc = "@brief Timestamp when the frame is captured.\n @attention Different device models may have different units. It is recommended to use the timestamp related functions to get the timestamp in the\n correct units."]
    Timestamp = 0,
    #[doc = "@brief Timestamp in the middle of the capture.\n @brief Usually is the middle of the exposure time.\n\n @attention Different device models may have different units."]
    SensorTimestamp = 1,
    #[doc = "@brief The number of current frame."]
    FrameNumber = 2,
    #[doc = "@brief Auto exposure status\n @brief If the value is 0, it means the auto exposure is disabled. Otherwise, it means the auto exposure is enabled."]
    AutoExposure = 3,
    #[doc = "@brief Exposure time\n\n @attention Different sensor may have different units. Usually, it is 100us for color sensor and 1us for depth/infrared sensor."]
    Exposure = 4,
    #[doc = "@brief Gain\n\n @attention For some device models, the gain value represents the gain level, not the multiplier."]
    Gain = 5,
    #[doc = "@brief Auto white balance status\n @brief If the value is 0, it means the auto white balance is disabled. Otherwise, it means the auto white balance is enabled."]
    AutoWhiteBalance = 6,
    #[doc = "@brief White balance"]
    WhiteBalance = 7,
    #[doc = "@brief Brightness"]
    Brightness = 8,
    #[doc = "@brief Contrast"]
    Contrast = 9,
    #[doc = "@brief Saturation"]
    Saturation = 10,
    #[doc = "@brief Sharpness"]
    Sharpness = 11,
    #[doc = "@brief Backlight compensation"]
    BacklightCompensation = 12,
    #[doc = "@brief Hue"]
    Hue = 13,
    #[doc = "@brief Gamma"]
    Gamma = 14,
    #[doc = "@brief Power line frequency\n @brief For anti-flickering, 0: Close, 1: 50Hz, 2: 60Hz, 3: Auto"]
    PowerLineFrequency = 15,
    #[doc = "@brief Low light compensation\n\n @attention The low light compensation is a feature inside the device, and can not manually control it."]
    LowLightCompensation = 16,
    #[doc = "@brief Manual white balance setting"]
    ManualWhiteBalance = 17,
    #[doc = "@brief Actual frame rate\n @brief The actual frame rate will be calculated according to the exposure time and other parameters."]
    ActualFrameRate = 18,
    #[doc = "@brief Frame rate"]
    FrameRate = 19,
    #[doc = "@brief Left region of interest for the auto exposure Algorithm."]
    AeRoiLeft = 20,
    #[doc = "@brief Top region of interest for the auto exposure Algorithm."]
    AeRoiTop = 21,
    #[doc = "@brief Right region of interest for the auto exposure Algorithm."]
    AeRoiRight = 22,
    #[doc = "@brief Bottom region of interest for the auto exposure Algorithm."]
    AeRoiBottom = 23,
    #[doc = "@brief Exposure priority"]
    ExposurePriority = 24,
    #[doc = "@brief HDR sequence name"]
    HdrSequenceName = 25,
    #[doc = "@brief HDR sequence size"]
    HdrSequenceSize = 26,
    #[doc = "@brief HDR sequence index"]
    HdrSequenceIndex = 27,
    #[doc = "@brief Laser power value in mW\n\n @attention The laser power value is an approximate estimation."]
    LaserPower = 28,
    #[doc = "@brief Laser power level"]
    LaserPowerLevel = 29,
    #[doc = "@brief Laser status\n @brief 0: Laser off, 1: Laser on"]
    LaserStatus = 30,
    #[doc = "@brief GPIO input data"]
    GpioInputData = 31,
    #[doc = "@brief disparity search offset value"]
    DisparitySearchOffset = 32,
    #[doc = "@brief disparity search range"]
    DisparitySearchRange = 33,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief For Linux, there are two ways to access the UVC device, libuvc and v4l2. The backend type is used to select the backend to access the device."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBUvcBackendType {
    #[doc = "@brief Auto detect system capabilities and device hint to select backend"]
    Auto = 0,
    #[doc = "@brief Use libuvc backend to access the UVC device"]
    Libuvc = 1,
    #[doc = "@brief Use v4l2 backend to access the UVC device"]
    V4L2 = 2,
    #[doc = "@brief Use MSMF backend to access the UVC device"]
    Msmf = 3,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief The playback status of the media"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPlaybackStatus {
    Unknown = 0,
    #[doc = "The media is playing"]
    Playing = 1,
    #[doc = "The media is paused"]
    Paused = 2,
    #[doc = "The media is stopped"]
    Stopped = 3,
    Count = 4,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Intra-camera Sync Reference based on the exposure start time, the exposure middle time, or the exposure end time."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBIntraCameraSyncReference {
    #[doc = "start of exposure"]
    StartOfExposure = 0,
    #[doc = "middle of exposure"]
    MiddleOfExposure = 1,
    #[doc = "end of exposure"]
    EndOfExposure = 2,
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Device access mode for GigE network device"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBDeviceAccessMode {
    #[doc = "No access. This value is only used as a return value"]
    AccessDenied = 0,
    #[doc = "Exclusive access: full read/write, no other application allowed; can preempt existing monitor access"]
    ExclusiveAccess = 1,
    #[doc = "Control access: read/write allowed; other applications permitted read-only monitor access"]
    ControlAccess = 2,
    #[doc = "Monitor access: read-only; no write or control privileges"]
    MonitorAccess = 3,
    #[doc = "Default access: control access for capable devices, ignored otherwise"]
    DefaultAccess = 4,
}
#[doc = "@brief Callback for file transfer\n\n @param[in] state Transmission status\n @param[in] message Transfer status information\n @param[in] percent Transfer progress percentage\n @param[in] user_data User-defined data"]
pub type ob_file_send_callback = ::std::option::Option<
    unsafe extern "C" fn(
        state: ob_file_tran_state,
        message: *const ::std::os::raw::c_char,
        percent: u8,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for firmware upgrade\n\n @param[in] state Upgrade status\n @param[in] message Upgrade status information\n @param[in] percent Upgrade progress percentage\n @param[in] user_data User-defined data"]
pub type ob_device_fw_update_callback = ::std::option::Option<
    unsafe extern "C" fn(
        state: ob_fw_update_state,
        message: *const ::std::os::raw::c_char,
        percent: u8,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for device status\n\n @param[in] state Device status\n @param[in] message Device status information\n @param[in] user_data User-defined data"]
pub type ob_device_state_callback = ::std::option::Option<
    unsafe extern "C" fn(
        state: ob_device_state,
        message: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for writing data\n\n @param[in] state Write data status\n @param[in] percent Write data percentage\n @param[in] user_data User-defined data"]
pub type ob_set_data_callback = ::std::option::Option<
    unsafe extern "C" fn(
        state: ob_data_tran_state,
        percent: u8,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for reading data\n\n @param[in] state Read data status\n @param[in] dataChunk Read the returned data block\n @param[in] user_data User-defined data"]
pub type ob_get_data_callback = ::std::option::Option<
    unsafe extern "C" fn(
        state: ob_data_tran_state,
        dataChunk: *mut ob_data_chunk,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for media status (recording and playback)\n\n @param[in] state Condition\n @param[in] user_data User-defined data"]
pub type ob_media_state_callback = ::std::option::Option<
    unsafe extern "C" fn(state: ob_media_state, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "@brief Callback for device change\n\n @param[in] removed List of deleted (dropped) devices\n @param[in] added List of added (online) devices\n @param[in] user_data User-defined data"]
pub type ob_device_changed_callback = ::std::option::Option<
    unsafe extern "C" fn(
        removed: *mut ob_device_list,
        added: *mut ob_device_list,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = "@brief Callback for frame\n\n @param[in] frame Frame object\n @param[in] user_data User-defined data"]
pub type ob_frame_callback = ::std::option::Option<
    unsafe extern "C" fn(frame: *mut ob_frame, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "@brief Callback for frameset\n\n @param[in] frameset Frameset object\n @param[in] user_data User-defined data"]
pub type ob_frameset_callback = ::std::option::Option<
    unsafe extern "C" fn(frameset: *mut ob_frame, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "@brief Customize the delete callback\n\n @param[in] buffer Data that needs to be deleted\n @param[in] user_data User-defined data"]
pub type ob_frame_destroy_callback = ::std::option::Option<
    unsafe extern "C" fn(buffer: *mut u8, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "@brief Callback for receiving log\n\n @param[in] severity Current log level\n @param[in] message Log message\n @param[in] user_data User-defined data"]
pub type ob_log_callback = ::std::option::Option<
    unsafe extern "C" fn(
        severity: ob_log_severity,
        message: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;
pub type ob_playback_status_changed_callback = ::std::option::Option<
    unsafe extern "C" fn(status: OBPlaybackStatus, user_data: *mut ::std::os::raw::c_void),
>;
#[doc = "@brief Callback Id"]
pub type OBCallbackId = u64;
#[doc = "@brief Callback Id"]
pub type ob_callback_id = u64;
unsafe extern "C" {
    #[doc = "@brief Create a context object with the default configuration file\n\n @param[out] error Pointer to an error object that will be populated if an error occurs during context creation\n\n @return Pointer to the created context object"]
    pub fn ob_create_context(error: *mut *mut ob_error) -> *mut ob_context;
}
unsafe extern "C" {
    #[doc = "@brief Create a context object with a specified configuration file\n\n @param[in] config_file_path Path to the configuration file. If NULL, the default configuration file will be used.\n @param[out] error Pointer to an error object that will be populated if an error occurs during context creation\n\n @return Pointer to the created context object"]
    pub fn ob_create_context_with_config(
        config_file_path: *const ::std::os::raw::c_char,
        error: *mut *mut ob_error,
    ) -> *mut ob_context;
}
unsafe extern "C" {
    #[doc = "@brief Delete a context object\n\n @param[in] context Pointer to the context object to be deleted\n @param[out] error Pointer to an error object that will be populated if an error occurs during context deletion"]
    pub fn ob_delete_context(context: *mut ob_context, error: *mut *mut ob_error);
}
unsafe extern "C" {
    #[doc = "@brief Get a list of enumerated devices\n\n @param[in] context Pointer to the context object\n @param[out] error Pointer to an error object that will be populated if an error occurs during device enumeration\n\n @return Pointer to the device list object"]
    pub fn ob_query_device_list(
        context: *mut ob_context,
        error: *mut *mut ob_error,
    ) -> *mut ob_device_list;
}
unsafe extern "C" {
    #[doc = "@brief Enable or disable network device enumeration\n @brief After enabling, the network device will be automatically discovered and can be retrieved through @ref ob_query_device_list. The default state can be\n set in the configuration file.\n\n @attention Network device enumeration is performed through the GVCP protocol. If the device is not in the same subnet as the host, it will be discovered but\n cannot be connected.\n\n @param[in] context Pointer to the context object\n @param[in] enable true to enable, false to disable\n @param[out] error Pointer to an error object that will be populated if an error occurs."]
    pub fn ob_enable_net_device_enumeration(
        context: *mut ob_context,
        enable: bool,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief \"Force\" a static IP address configuration in a device identified by its MAC Address.\n\n @param[in] macAddress MAC address of the network device.\n                       You can obtain it from @ref ob_device_info_get_uid, or specify it manually\n                       in the format xx:xx:xx:xx:xx:xx, where each xx is a two-digit hexadecimal value.\n @param[in] config The new IP configuration.\n @param[out] error Pointer to an error object that will be populated if an error occurs.\n\n @return bool true if the configuration command was processed successfully, false otherwise.\n\n @note This applies to all GigE Vision devices"]
    pub fn ob_force_ip_config(
        macAddress: *const ::std::os::raw::c_char,
        config: ob_net_ip_config,
        error: *mut *mut ob_error,
    ) -> bool;
}
unsafe extern "C" {
    #[doc = "@brief Create a network device object\n\n @param[in] context Pointer to the context object\n @param[in] address IP address of the device\n @param[in] port Port number of the device\n @param[out] error Pointer to an error object that will be populated if an error occurs during device creation\n\n @return Pointer to the created device object"]
    pub fn ob_create_net_device(
        context: *mut ob_context,
        address: *const ::std::os::raw::c_char,
        port: u16,
        error: *mut *mut ob_error,
    ) -> *mut ob_device;
}
unsafe extern "C" {
    #[doc = "@brief Create a network device object\n\n @param[in] context Pointer to the context object\n @param[in] address IP address of the device\n @param[in] port Port number of the device\n @param[in] accessMode Device access mode. @ref ob_device_access_mode.\n                       If the device does not support setting the Access Mode, the default OB_DEVICE_DEFAULT_ACCESS is used.\n                       Applies only on first device creation or after release and re-creation; subsequent calls ignore it.\n @param[out] error Pointer to an error object that will be populated if an error occurs during device creation\n\n @return Pointer to the created device object"]
    pub fn ob_create_net_device_ex(
        context: *mut ob_context,
        address: *const ::std::os::raw::c_char,
        port: u16,
        accessMode: OBDeviceAccessMode,
        error: *mut *mut ob_error,
    ) -> *mut ob_device;
}
unsafe extern "C" {
    #[doc = "@brief Set a device plug-in callback function\n\n @deprecated This function is deprecated. Please use ob_register_device_changed_callback() instead.\n\n @attention The added and removed device lists returned through the callback interface need to be released manually\n @attention This function supports multiple callbacks. Each call to this function adds a new callback to an internal list.\n\n @param[in] context Pointer to the context object\n @param[in] callback Pointer to the callback function triggered when a device is plugged or unplugged\n @param[in] user_data Pointer to user data that can be passed to and retrieved from the callback function\n @param[out] error Pointer to an error object that will be populated if an error occurs during callback function setting"]
    pub fn ob_set_device_changed_callback(
        context: *mut ob_context,
        callback: ob_device_changed_callback,
        user_data: *mut ::std::os::raw::c_void,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Register a device plug-in callback function.\n\n This function registers a callback that will be triggered whenever a device is plugged in or unplugged.\n\n @attention The added and removed device lists returned through the callback interface need to be released manually.\n @attention This function supports multiple callbacks. Each call to this function adds a new callback to an internal list.\n\n @param[in] context Pointer to the context object.\n @param[in] callback Pointer to the callback function triggered when a device is plugged or unplugged.\n @param[in] user_data Pointer to user data that can be passed to and retrieved from the callback function.\n @param[out] error Pointer to an error object that will be populated if an error occurs during callback function setting.\n\n @return A ob_callback_id that uniquely identifies the registered callback.\n         This ID can be used later to unregister the callback with ob_unregister_device_changed_callback().\n         Returns INVALID_DEVICE_CHANGED_CALLBACK_ID if the registration fails."]
    pub fn ob_register_device_changed_callback(
        context: *mut ob_context,
        callback: ob_device_changed_callback,
        user_data: *mut ::std::os::raw::c_void,
        error: *mut *mut ob_error,
    ) -> ob_callback_id;
}
unsafe extern "C" {
    #[doc = "@brief Unregister a previously registered device plug-in callback function.\n\n This function removes a callback that was registered by ob_register_device_changed_callback().\n\n @param[in] context Pointer to the context object.\n @param[in] callback_id The callback ID returned by ob_register_device_changed_callback().\n @param[out] error Pointer to an error object that will be populated if an error occurs during callback function setting."]
    pub fn ob_unregister_device_changed_callback(
        context: *mut ob_context,
        callback_id: ob_callback_id,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Activates device clock synchronization to synchronize the clock of the host and all created devices (if supported).\n\n @param[in] context Pointer to the context object\n @param[in] repeat_interval_msec The interval for auto-repeated synchronization, in milliseconds. If the value is 0, synchronization is performed only once.\n @param[out] error Pointer to an error object that will be populated if an error occurs during execution"]
    pub fn ob_enable_device_clock_sync(
        context: *mut ob_context,
        repeat_interval_msec: u64,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Free idle memory from the internal frame memory pool\n\n @param[in] context Pointer to the context object\n @param[out] error Pointer to an error object that will be populated if an error occurs during memory freeing"]
    pub fn ob_free_idle_memory(context: *mut ob_context, error: *mut *mut ob_error);
}
unsafe extern "C" {
    #[doc = "@brief For linux, there are two ways to enable the UVC backend: libuvc and v4l2. This function is used to set the backend type.\n @brief It is effective when the new device is created.\n\n @attention This interface is only available for Linux.\n\n @param[in] context Pointer to the context object\n @param[in] backend_type The backend type to be used.\n @param[out] error Pointer to an error object that will be populated if an error occurs during backend type setting"]
    pub fn ob_set_uvc_backend_type(
        context: *mut ob_context,
        backend_type: OBUvcBackendType,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Set the global log level\n\n @attention This interface setting will affect the output level of all logs (terminal, file, callback)\n\n @param[in] severity Log level to set\n @param[out] error Pointer to an error object that will be populated if an error occurs during log level setting"]
    pub fn ob_set_logger_severity(severity: ob_log_severity, error: *mut *mut ob_error);
}
unsafe extern "C" {
    #[doc = "@brief Set the log output to a file\n\n @param[in] severity Log level to output to file\n @param[in] directory Path to the log file output directory.\n                      If empty, the existing configuration is used;\n                      if the existing configuration is also empty,\n                      the value from the config file or the default configuration will be used.\n @param[out] error Pointer to an error object that will be populated if an error occurs during log output setting\n\n @note Other settings, such as log file name, remain unchanged."]
    pub fn ob_set_logger_to_file(
        severity: ob_log_severity,
        directory: *const ::std::os::raw::c_char,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Set the log file name for file output\n\n @param[in] file_name Log file name. Must not be empty.\n @param[out] error Pointer to an error object that will be set if an error occurs.\n\n @note Other settings, such as log level and output directory, remain unchanged."]
    pub fn ob_set_logger_file_name(
        file_name: *const ::std::os::raw::c_char,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Set the log callback function\n\n @param[in] severity Log level to set for the callback function\n @param[in] callback Pointer to the callback function\n @param[in] user_data Pointer to user data that can be passed to and retrieved from the callback function\n @param[out] error Pointer to an error object that will be populated if an error occurs during log callback function setting"]
    pub fn ob_set_logger_to_callback(
        severity: ob_log_severity,
        callback: ob_log_callback,
        user_data: *mut ::std::os::raw::c_void,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Set the log output to the console\n\n @param[in] severity Log level to output to the console\n @param[out] error Pointer to an error object that will be populated if an error occurs during log output setting"]
    pub fn ob_set_logger_to_console(severity: ob_log_severity, error: *mut *mut ob_error);
}
unsafe extern "C" {
    #[doc = "@brief Logs a message with severity, file, function, and line info.\n\n @param[in] severity Log level, see @ref ob_log_severity for details\n @param[in] module The module or component the log belongs to\n @param[in] message Message string to log\n @param[in] file Source file name, e.g., __FILE__\n @param[in] func Function name, e.g., __func__\n @param[in] line Line number, e.g., __LINE__\n @param[out] error Pointer to an error object that will be populated if an error occurs during log output setting"]
    pub fn ob_log_external_message(
        severity: ob_log_severity,
        module: *const ::std::os::raw::c_char,
        message: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        func: *const ::std::os::raw::c_char,
        line: ::std::os::raw::c_int,
        error: *mut *mut ob_error,
    );
}
unsafe extern "C" {
    #[doc = "@brief Set the extensions directory\n @brief The extensions directory is used to search for dynamic libraries that provide additional functionality to the SDK, such as the Frame filters.\n\n @attention Should be called before creating the context and pipeline, otherwise the default extensions directory (./extensions) will be used.\n\n @param[in] directory Path to the extensions directory. If the path is empty, extensions path will be set to the current working directory.\n @param[out] error Pointer to an error object that will be populated if an error occurs during extensions directory setting"]
    pub fn ob_set_extensions_directory(
        directory: *const ::std::os::raw::c_char,
        error: *mut *mut ob_error,
    );
}
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief Enumeration value describing all attribute control commands of the device"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPropertyID {
    #[doc = "@brief LDP switch"]
    Ldp = 2,
    #[doc = "@brief Laser switch"]
    Laser = 3,
    #[doc = "@brief laser pulse width"]
    LaserPulseWidth = 4,
    #[doc = "@brief Laser current (uint: mA)"]
    LaserCurrent = 5,
    #[doc = "@brief IR flood switch"]
    Flood = 6,
    #[doc = "@brief IR flood level"]
    FloodLevel = 7,
    #[doc = "@brief Enable/disable temperature compensation"]
    TemperatureCompensation = 8,
    #[doc = "@brief Depth mirror"]
    DepthMirror = 14,
    #[doc = "@brief Depth flip"]
    DepthFlip = 15,
    #[doc = "@brief Depth Postfilter"]
    DepthPostfilter = 16,
    #[doc = "@brief Depth Holefilter"]
    DepthHolefilter = 17,
    #[doc = "@brief IR mirror"]
    IrMirror = 18,
    #[doc = "@brief IR flip"]
    IrFlip = 19,
    #[doc = "@brief Minimum depth threshold"]
    MinDepth = 22,
    #[doc = "@brief Maximum depth threshold"]
    MaxDepth = 23,
    #[doc = "@brief Software filter switch"]
    DepthNoiseRemovalFilter = 24,
    #[doc = "@brief LDP status"]
    LdpStatus = 32,
    #[doc = "@brief maxdiff for depth noise removal filter"]
    DepthNoiseRemovalFilterMaxDiff = 40,
    #[doc = "@brief maxSpeckleSize for depth noise removal filter"]
    DepthNoiseRemovalFilterMaxSpeckleSize = 41,
    #[doc = "@brief Hardware d2c is on"]
    DepthAlignHardware = 42,
    #[doc = "@brief Timestamp adjustment"]
    TimestampOffset = 43,
    #[doc = "@brief Hardware distortion switch Rectify"]
    HardwareDistortionSwitch = 61,
    #[doc = "@brief Fan mode switch"]
    FanWorkMode = 62,
    #[doc = "@brief Multi-resolution D2C mode"]
    DepthAlignHardwareMode = 63,
    #[doc = "@brief Anti_collusion activation status"]
    AntiCollusionActivationStatus = 64,
    #[doc = "@brief the depth precision level, which may change the depth frame data unit, needs to be confirmed through the ValueScale interface of\n DepthFrame"]
    DepthPrecisionLevel = 75,
    #[doc = "@brief tof filter range configuration"]
    TofFilterRange = 76,
    #[doc = "@brief laser mode, the firmware terminal currently only return 1: IR Drive, 2: Torch"]
    LaserMode = 79,
    #[doc = "@brief brt2r-rectify function switch (brt2r is a special module on mx6600), 0: Disable, 1: Rectify Enable"]
    Rectify2 = 80,
    #[doc = "@brief Color mirror"]
    ColorMirror = 81,
    #[doc = "@brief Color flip"]
    ColorFlip = 82,
    #[doc = "@brief Indicator switch, 0: Disable, 1: Enable"]
    IndicatorLight = 83,
    #[doc = "@brief Disparity to depth switch, false: switch to software disparity convert to depth, true: switch to hardware disparity convert to depth"]
    DisparityToDepth = 85,
    #[doc = "@brief BRT function switch (anti-background interference), 0: Disable, 1: Enable"]
    Brt = 86,
    #[doc = "@brief Watchdog function switch, 0: Disable, 1: Enable"]
    Watchdog = 87,
    #[doc = "@brief External signal trigger restart function switch, 0: Disable, 1: Enable"]
    ExternalSignalReset = 88,
    #[doc = "@brief Heartbeat monitoring function switch, 0: Disable, 1: Enable"]
    Heartbeat = 89,
    #[doc = "@brief Depth cropping mode device: OB_DEPTH_CROPPING_MODE"]
    DepthCroppingMode = 90,
    #[doc = "@brief D2C preprocessing switch (such as RGB cropping), 0: off, 1: on"]
    D2CPreprocess = 91,
    #[doc = "@brief Enable/disable GPM function"]
    Gpm = 93,
    #[doc = "@brief Custom RGB cropping switch, 0 is off, 1 is on custom cropping, and the ROI cropping area is issued"]
    RgbCustomCrop = 94,
    #[doc = "@brief Device operating mode (power consumption)"]
    DeviceWorkMode = 95,
    #[doc = "@brief Device communication type, 0: USB; 1: Ethernet(RTSP)"]
    DeviceCommunicationType = 97,
    #[doc = "@brief Switch infrared imaging mode, 0: active IR mode, 1: passive IR mode"]
    SwitchIrMode = 98,
    #[doc = "@brief Laser power level"]
    LaserPowerLevelControl = 99,
    #[doc = "@brief LDP's measure distance, unit: mm"]
    LdpMeasureDistance = 100,
    #[doc = "@brief Reset device time to zero"]
    TimerResetSignal = 104,
    #[doc = "@brief Enable send reset device time signal to other device. true: enable, false: disable"]
    TimerResetTriggerOutEnable = 105,
    #[doc = "@brief Delay to reset device time, unit: us"]
    TimerResetDelayUs = 106,
    #[doc = "@brief Signal to capture image"]
    CaptureImageSignal = 107,
    #[doc = "@brief Right IR sensor mirror state"]
    IrRightMirror = 112,
    #[doc = "@brief Number frame to capture once a 'OB_PROP_CAPTURE_IMAGE_SIGNAL_BOOL' effect. range: [1, 255]"]
    CaptureImageFrameNumber = 113,
    #[doc = "@brief Right IR sensor flip state. true: flip image, false: origin, default: false"]
    IrRightFlip = 114,
    #[doc = "@brief Color sensor rotation, angle{0, 90, 180, 270}"]
    ColorRotate = 115,
    #[doc = "@brief IR/Left-IR sensor rotation, angle{0, 90, 180, 270}"]
    IrRotate = 116,
    #[doc = "@brief Right IR sensor rotation, angle{0, 90, 180, 270}"]
    IrRightRotate = 117,
    #[doc = "@brief Depth sensor rotation, angle{0, 90, 180, 270}"]
    DepthRotate = 118,
    #[doc = "@brief Get hardware laser power actual level which real state of laser element. OB_PROP_LASER_POWER_LEVEL_CONTROL_INT99 will effect this command\n which it setting and changed the hardware laser energy level."]
    LaserPowerActualLevel = 119,
    #[doc = "@brief USB's power state, enum type: OBUSBPowerState"]
    UsbPowerState = 121,
    #[doc = "@brief DC's power state, enum type: OBDCPowerState"]
    DcPowerState = 122,
    #[doc = "@brief Device development mode switch, optional modes can refer to the definition in @ref OBDeviceDevelopmentMode,the default mode is\n @ref OB_USER_MODE\n @attention The device takes effect after rebooting when switching modes."]
    DeviceDevelopmentMode = 129,
    #[doc = "@brief Multi-DeviceSync synchronized signal trigger out is enable state. true: enable, false: disable"]
    SyncSignalTriggerOut = 130,
    #[doc = "@brief Restore factory settings and factory parameters\n @attention This command can only be written, and the parameter value must be true. The command takes effect after restarting the device."]
    RestoreFactorySettings = 131,
    #[doc = "@brief Enter recovery mode (flashing mode) when boot the device\n @attention The device will take effect after rebooting with the enable option. After entering recovery mode, you can upgrade the device system. Upgrading\n the system may cause system damage, please use it with caution."]
    BootIntoRecoveryMode = 132,
    #[doc = "@brief Query whether the current device is running in recovery mode (read-only)"]
    DeviceInRecoveryMode = 133,
    #[doc = "@brief Capture interval mode, 0:time interval, 1:number interval"]
    CaptureIntervalMode = 134,
    #[doc = "@brief Capture time interval"]
    CaptureImageTimeInterval = 135,
    #[doc = "@brief Capture number interval"]
    CaptureImageNumberInterval = 136,
    TimerResetEnable = 140,
    #[doc = "@brief Enable or disable the device to retry USB2.0 re-identification when the device is connected to a USB2.0 port.\n @brief This feature ensures that the device is not mistakenly identified as a USB 2.0 device when connected to a USB 3.0 port."]
    DeviceUsb2RepeatIdentify = 141,
    #[doc = "@brief Reboot device delay mode. Delay time unit: ms, range: [0, 8000)."]
    DeviceRebootDelay = 142,
    #[doc = "@brief Query the status of laser overcurrent protection (read-only)"]
    LaserOvercurrentProtectionStatus = 148,
    #[doc = "@brief Query the status of laser pulse width protection (read-only)"]
    LaserPulseWidthProtectionStatus = 149,
    #[doc = "@brief Laser always on, true: always on, false: off, laser will be turned off when out of exposure time"]
    LaserAlwaysOn = 174,
    #[doc = "@brief Laser on/off alternate mode, 0: off, 1: on-off alternate, 2: off-on alternate\n @attention When turn on this mode, the laser will turn on and turn off alternately each frame."]
    LaserOnOffPattern = 175,
    #[doc = "@brief Depth unit flexible adjustment\\\n @brief This property allows continuous adjustment of the depth unit, unlike @ref OB_PROP_DEPTH_PRECISION_LEVEL_INT must be set to some fixed value."]
    DepthUnitFlexibleAdjustment = 176,
    #[doc = "@brief Laser control, 0: off, 1: on, 2: auto"]
    LaserControl = 182,
    #[doc = "@brief IR brightness"]
    IrBrightness = 184,
    #[doc = "@brief Slave/secondary device synchronization status (read-only)"]
    SlaveDeviceSyncStatus = 188,
    #[doc = "@brief Color AE max exposure"]
    ColorAeMaxExposure = 189,
    #[doc = "@brief Max exposure time of IR auto exposure"]
    IrAeMaxExposure = 190,
    #[doc = "@brief Disparity search range mode, 1: 128, 2: 256"]
    DispSearchRangeMode = 191,
    #[doc = "@brief Laser high temperature protection"]
    LaserHighTemperatureProtect = 193,
    #[doc = "@brief low exposure laser control\n\n @brief Currently using for DabaiA device,if the exposure value is lower than a certain threshold, the laser is turned off;\n if it exceeds another threshold, the laser is turned on again."]
    LowExposureLaserControl = 194,
    #[doc = "@brief check pps sync in signal"]
    CheckPpsSyncInSignal = 195,
    #[doc = "@brief Disparity search range offset, range: [0, 127]"]
    DispSearchOffset = 196,
    #[doc = "@brief cpu temperature correction . true: calibrate temperature"]
    CpuTemperatureCalibration = 199,
    #[doc = "@brief Repower device (cut off power and power on again)\n\n @brief Currently using for GMSL device, cut off power and power on again by GMSL host driver."]
    DeviceRepower = 202,
    #[doc = "@brief frame interleave config index"]
    FrameInterleaveConfigIndex = 204,
    #[doc = "@brief frame interleave enable (true:enable,false:disable)"]
    FrameInterleaveEnable = 205,
    #[doc = "@brief laser pattern sync with delay(us)"]
    FrameInterleaveLaserPatternSyncDelay = 206,
    #[doc = "@brief Get the health check result from device,range is [0.0f,1.5f]"]
    OnChipCalibrationHealthCheck = 209,
    #[doc = "@brief Enable or disable on-chip calibration"]
    OnChipCalibrationEnable = 210,
    #[doc = "@brief hardware noise remove filter switch"]
    HwNoiseRemoveFilterEnable = 211,
    #[doc = "@brief hardware noise remove filter threshold ,range [0.0 - 1.0]"]
    HwNoiseRemoveFilterThreshold = 212,
    #[doc = "@brief soft trigger auto capture enable, use in OB_MULTI_DEVICE_SYNC_MODE_SOFTWARE_TRIGGERING mode"]
    AutoCaptureEnable = 216,
    #[doc = "@brief soft trigger auto capture interval time, use in OB_MULTI_DEVICE_SYNC_MODE_SOFTWARE_TRIGGERING mode"]
    AutoCaptureIntervalTime = 217,
    #[doc = "@brief PTP time synchronization enable"]
    PtpClockSyncEnable = 223,
    #[doc = "@brief Depth with confidence stream enable"]
    DepthWithConfidenceStreamEnable = 224,
    #[doc = "@brief Enable or disable confidence stream filter"]
    ConfidenceStreamFilter = 226,
    #[doc = "@brief Confidence stream filter threshold, range [0, 255]"]
    ConfidenceStreamFilterThreshold = 227,
    #[doc = "@brief Confidence stream mirror enable"]
    ConfidenceMirror = 229,
    #[doc = "@brief Confidence stream flip enable"]
    ConfidenceFlip = 230,
    #[doc = "@brief Confidence stream rotate angle{0, 90, 180, 270}"]
    ConfidenceRotate = 231,
    #[doc = "@brief Intra-camera Sync Reference based on the exposure start time, the exposure middle time, or the exposure end time. the definition in @ref\n OBIntraCameraSyncReference"]
    IntraCameraSyncReference = 236,
    #[doc = "@brief Right Color sensor rotation, angle{0, 90, 180, 270}"]
    ColorRightRotate = 242,
    #[doc = "@brief Right Color mirror"]
    ColorRightMirror = 243,
    #[doc = "@brief Right Color flip"]
    ColorRightFlip = 244,
    #[doc = "@brief Device AE reference source\n - 0: Depth based\n - 1: Color based"]
    DeviceAeReference = 247,
    #[doc = "@brief Device AE strategy\n - 0: Default\n - 1: Motion"]
    DeviceAeStrategy = 248,
    #[doc = "@brief Color camera ROI brightness adjustment"]
    ColorRoiBrightness = 249,
    #[doc = "@brief Left Color sensor rotation, angle{0, 90, 180, 270}"]
    ColorLeftRotate = 251,
    #[doc = "@brief Left Color mirror"]
    ColorLeftMirror = 252,
    #[doc = "@brief Left Color flip"]
    ColorLeftFlip = 253,
    #[doc = "@brief Color camera preset priority"]
    ColorPresetPriority = 255,
    #[doc = "@brief Baseline calibration parameters"]
    BaselineCalibrationParam = 1002,
    #[doc = "@brief Device temperature information"]
    DeviceTemperature = 1003,
    #[doc = "@brief TOF exposure threshold range"]
    TofExposureThresholdControl = 1024,
    #[doc = "@brief get/set serial number"]
    DeviceSerialNumber = 1035,
    #[doc = "@brief get/set device time"]
    DeviceTime = 1037,
    #[doc = "@brief Multi-device synchronization mode and parameter configuration"]
    MultiDeviceSyncConfig = 1038,
    #[doc = "@brief RGB cropping ROI"]
    RgbCropRoi = 1040,
    #[doc = "@brief Device IP address configuration"]
    DeviceIpAddrConfig = 1041,
    #[doc = "@brief The current camera depth mode"]
    CurrentDepthAlgMode = 1043,
    #[doc = "@brief A list of depth accuracy levels, returning an array of uin16_t, corresponding to the enumeration"]
    DepthPrecisionSupportList = 1045,
    #[doc = "@brief Device network static ip config record\n @brief Using for get last static ip config, witch is record in device flash when user set static ip config\n\n @attention read only"]
    DeviceStaticIpConfigRecord = 1053,
    #[doc = "@brief Using to configure the depth sensor's HDR mode\n @brief The Value type is @ref OBHdrConfig\n\n @attention After enable HDR mode, the depth sensor auto exposure will be disabled."]
    DepthHdrConfig = 1059,
    #[doc = "@brief Color Sensor AE ROI configuration\n @brief The Value type is @ref OBRegionOfInterest"]
    ColorAeRoi = 1060,
    #[doc = "@brief Depth Sensor AE ROI configuration\n @brief The Value type is @ref OBRegionOfInterest\n @brief Since the ir sensor is the same physical sensor as the depth sensor, this property will also effect the ir sensor."]
    DepthAeRoi = 1061,
    #[doc = "@brief ASIC serial number"]
    AsicSerialNumber = 1063,
    #[doc = "@brief Disparity offset interleaving"]
    DispOffsetConfig = 1064,
    #[doc = "@brief Preset resolution ratio configuration"]
    PresetResolutionConfig = 1069,
    #[doc = "@brief Color sensor synchronized exposure parameter structure"]
    ColorSyncedExposureParam = 1077,
    #[doc = "@brief Color camera auto exposure"]
    ColorAutoExposure = 2000,
    #[doc = "@brief Color camera exposure adjustment"]
    ColorExposure = 2001,
    #[doc = "@brief Color camera gain adjustment"]
    ColorGain = 2002,
    #[doc = "@brief Color camera automatic white balance"]
    ColorAutoWhiteBalance = 2003,
    #[doc = "@brief Color camera white balance adjustment"]
    ColorWhiteBalance = 2004,
    #[doc = "@brief Color camera brightness adjustment"]
    ColorBrightness = 2005,
    #[doc = "@brief Color camera sharpness adjustment"]
    ColorSharpness = 2006,
    #[doc = "@brief Color camera shutter adjustment"]
    ColorShutter = 2007,
    #[doc = "@brief Color camera saturation adjustment"]
    ColorSaturation = 2008,
    #[doc = "@brief Color camera contrast adjustment"]
    ColorContrast = 2009,
    #[doc = "@brief Color camera gamma adjustment"]
    ColorGamma = 2010,
    #[doc = "@brief Color camera image rotation"]
    ColorRoll = 2011,
    #[doc = "@brief Color camera auto exposure priority"]
    ColorAutoExposurePriority = 2012,
    #[doc = "@brief Color camera brightness compensation"]
    ColorBacklightCompensation = 2013,
    #[doc = "@brief Color camera color tint"]
    ColorHue = 2014,
    #[doc = "@brief Color Camera Power Line Frequency"]
    ColorPowerLineFrequency = 2015,
    #[doc = "@brief Automatic exposure of depth camera (infrared camera will be set synchronously under some models of devices)"]
    DepthAutoExposure = 2016,
    #[doc = "@brief Depth camera exposure adjustment (infrared cameras will be set synchronously under some models of devices)"]
    DepthExposure = 2017,
    #[doc = "@brief Depth camera gain adjustment (infrared cameras will be set synchronously under some models of devices)"]
    DepthGain = 2018,
    #[doc = "@brief Infrared camera auto exposure (depth camera will be set synchronously under some models of devices)"]
    IrAutoExposure = 2025,
    #[doc = "@brief Infrared camera exposure adjustment (some models of devices will set the depth camera synchronously)"]
    IrExposure = 2026,
    #[doc = "@brief Infrared camera gain adjustment (the depth camera will be set synchronously under some models of devices)"]
    IrGain = 2027,
    #[doc = "@brief Select Infrared camera data source channel. If not support throw exception. 0 : IR stream from IR Left sensor; 1 : IR stream from IR Right sensor;"]
    IrChannelDataSource = 2028,
    #[doc = "@brief Depth effect dedistortion, true: on, false: off. mutually exclusive with D2C function, RM_Filter disable When hardware or software D2C is enabled."]
    DepthRmFilter = 2029,
    #[doc = "@brief Color camera maximal gain"]
    ColorMaximalGain = 2030,
    #[doc = "@brief Color camera shutter gain"]
    ColorMaximalShutter = 2031,
    #[doc = "@brief The enable/disable switch for IR short exposure function, supported only by a few devices."]
    IrShortExposure = 2032,
    #[doc = "@brief Color camera HDR"]
    ColorHdr = 2034,
    #[doc = "@brief IR long exposure mode switch read and write."]
    IrLongExposure = 2035,
    #[doc = "@brief Setting and getting the USB device frame skipping mode status, true: frame skipping mode, false: non-frame skipping mode."]
    SkipFrame = 2036,
    #[doc = "@brief Depth HDR merge, true: on, false: off."]
    HdrMerge = 2037,
    #[doc = "@brief Color camera FOCUS"]
    ColorFocus = 2038,
    #[doc = "@brief ir rectify status,true: ir rectify, false: no rectify"]
    IrRectify = 2040,
    #[doc = "@brief Depth camera priority"]
    DepthAutoExposurePriority = 2052,
    #[doc = "@brief Software disparity to depth"]
    SdkDisparityToDepth = 3004,
    #[doc = "@brief Depth data unpacking function switch (each open stream will be turned on by default, support RLE/Y10/Y11/Y12/Y14 format)"]
    SdkDepthFrameUnpack = 3007,
    #[doc = "@brief IR data unpacking function switch (each current will be turned on by default, support RLE/Y10/Y11/Y12/Y14 format)"]
    SdkIrFrameUnpack = 3008,
    #[doc = "@brief Accel data conversion function switch (on by default)"]
    SdkAccelFrameTransformed = 3009,
    #[doc = "@brief Gyro data conversion function switch (on by default)"]
    SdkGyroFrameTransformed = 3010,
    #[doc = "@brief Left IR frame data unpacking function switch (each current will be turned on by default, support RLE/Y10/Y11/Y12/Y14 format)"]
    SdkIrLeftFrameUnpack = 3011,
    #[doc = "@brief Right IR frame data unpacking function switch (each current will be turned on by default, support RLE/Y10/Y11/Y12/Y14 format)"]
    SdkIrRightFrameUnpack = 3012,
    #[doc = "@brief Depth Stream Industry Working Mode Settings, currently only supported by DCW2."]
    DepthIndustryMode = 3024,
    #[doc = "@brief Read the current network bandwidth type of the network device, whether it is Gigabit Ethernet or Fast Ethernet, such as G335LE."]
    NetworkBandwidthType = 3027,
    #[doc = "@brief Switch device performance mode, currently available in Adaptive Mode and High Performance Mode, such as G335LE."]
    DevicePerformanceMode = 3028,
    #[doc = "@brief Calibration JSON file read from device (Femto Mega, read only)"]
    CameraCalibJsonFile = 4029,
    #[doc = "@brief Confidence degree"]
    DebugEsgmConfidence = 5013,
    #[doc = "@brief Color camera CCI denoising level. 0: Auto; 1-8: higher values indicate stronger denoising.\n @note This setting has no effect when AE (Auto Exposure) is disabled."]
    ColorDenoisingLevel = 5525,
    LidarIpAddress = 8000,
    #[doc = "@brief LiDAR: set/get port"]
    LidarPort = 8001,
    #[doc = "@brief LiDAR: set/get MAC address"]
    LidarMacAddress = 8002,
    #[doc = "@brief LiDAR: set/get subnet mask"]
    LidarSubnetMask = 8003,
    #[doc = "@brief LiDAR: set/get work mode"]
    LidarWorkMode = 8004,
    #[doc = "@brief LiDAR: apply configs"]
    LidarApplyConfigs = 8005,
    #[doc = "@brief LiDAR: set/get tail filter level"]
    LidarTailFilterLevel = 8006,
    #[doc = "@brief LiDAR: set/get mems fov size"]
    LidarMemsFovSize = 8007,
    #[doc = "@brief LiDAR: set/get mems frequency"]
    LidarMemsFrenquency = 8008,
    #[doc = "@brief LiDAR: get product model"]
    LidarProductModel = 8009,
    #[doc = "@brief LiDAR: get firmware version"]
    LidarFirmwareVersion = 8010,
    #[doc = "@brief LiDAR: get fpga version"]
    LidarFpgaVersion = 8011,
    #[doc = "@brief LiDAR: get warning info"]
    LidarWarningInfo = 8012,
    #[doc = "@brief LiDAR: get realtime motor spin speed, unit:0.01rpm"]
    LidarMotorSpinSpeed = 8013,
    #[doc = "@brief LiDAR: get mcu temperature, uint: 0.01degrees delsius"]
    LidarMcuTemperature = 8014,
    #[doc = "@brief LiDAR: get apd temperature, uint: 0.01degrees delsius"]
    LidarApdTemperature = 8015,
    #[doc = "@brief LiDAR: get/set specific mode"]
    LidarSpecificMode = 8016,
    #[doc = "@brief LiDAR: get/set repetitive scan mode"]
    LidarRepetitiveScanMode = 8017,
}
#[doc = "@brief Enumeration value describing all attribute control commands of the device"]
pub use self::OBPropertyID as ob_property_id;
#[repr(u32)]
#[non_exhaustive]
#[doc = "@brief The data type used to describe all property settings"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OBPropertyType {
    #[doc = "Boolean property"]
    BoolProperty = 0,
    #[doc = "Integer property"]
    IntProperty = 1,
    #[doc = "Floating-point property"]
    FloatProperty = 2,
    #[doc = "Struct property"]
    StructProperty = 3,
}
#[doc = "@brief The data type used to describe all property settings"]
pub use self::OBPropertyType as ob_property_type;
#[doc = "@brief Used to describe the characteristics of each property"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OBPropertyItem {
    #[doc = "Property ID"]
    pub id: OBPropertyID,
    #[doc = "Property name"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = "Property type"]
    pub type_: OBPropertyType,
    #[doc = "Property read and write permission"]
    pub permission: OBPermissionType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OBPropertyItem"][::std::mem::size_of::<OBPropertyItem>() - 24usize];
    ["Alignment of OBPropertyItem"][::std::mem::align_of::<OBPropertyItem>() - 8usize];
    ["Offset of field: OBPropertyItem::id"][::std::mem::offset_of!(OBPropertyItem, id) - 0usize];
    ["Offset of field: OBPropertyItem::name"]
        [::std::mem::offset_of!(OBPropertyItem, name) - 8usize];
    ["Offset of field: OBPropertyItem::type_"]
        [::std::mem::offset_of!(OBPropertyItem, type_) - 16usize];
    ["Offset of field: OBPropertyItem::permission"]
        [::std::mem::offset_of!(OBPropertyItem, permission) - 20usize];
};
#[doc = "@brief Used to describe the characteristics of each property"]
pub type ob_property_item = OBPropertyItem;
unsafe extern "C" {
